pico-8 cartridge // http://www.pico-8.com
version 42
__lua__
-- poom
-- by @freds72
-- bootstrap cart
-- *********************************
-- generated code - do not edit
-- *********************************

-- *********************************
-- generated code - do not edit
-- *********************************
mod_name,title_cart="poom","#poom_0"
_map_offset=0xbe74
local _sky_height,_sky_offset=55,0x4500
_map_music=0
_wp_wheel=split("-1|ovalfill|51,81,75,99,0x22|1|rectfill|21,86,49,94,0|1|print|⬅️,52,88,5|1|print|shotgun,22,88,11|5|print|🅾️,60,88,5","|")
  


title_gfx={bytes="\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0!■■■■■■■\"²\0\0\0▮■■■■■!²\0\0\0 □■■■■■¹\0\49\"■■■■\0\0\"■■■!¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▮\51\51\51\51\51\51\51\51#\0\0\0\50\51\51\51\51\51\51#\0\0\0\50\51\51\51\51\51\51\"@‖\51\51\51\51#\0▮\51\51\51\51⁙\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0bfgffgfg\54²\0 ffvffvf\54²\0 cfffgfvfB░cfvf&\0\57agfg²\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0rgggggggw#\0bvfvwvすvw#\0\50gvvwggwf&Hswvv◀B\53iggg²\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0bgwggfちgv\55⁵rwvvfvせwf\54⬆️cwちvffgすち'Xcvvち∧🐱!wggw²\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0bggfzgjvす\54✽rfすvwせちすv\54⬆️cgすすvすちせf&Xsすfすf🐱□gfjg²\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0bjwちjwzvす\54✽けzせwすvvせv\55▤sgせせvすvすv&Xrせwすw🐱★gwちz²\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0けちggwzjせせ&✽けvすzすすせせf\55▤rzせせせwvすせ*Xbすすvf!bちjfg²\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0rすg*\"\"けせす*✽けすf&\"\"けすち'▤rzw'\"\"rほv&Xけちほvv)agzwz²\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0けすせ*HDrほf'✽けせち&HDけgw'▤rzめ*D░bへす&Xrwほせす'igkf{²\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0けほg&っ●けむ{*✽けほす&hHけめせ*▤け{{'░●のめせ*Xけめめちせ*ちせめz{²\0\0\0\0\0█\0\0\0\0\0\0\0\0\0\0\0\0\0けほつ'dアrz{+✽のめほ'dlrほw'▤rw{*をFrちほ*Xrほzせほ▶ほせwちつ²\0\0\0\0\0D⁶\0\0\0\0\0\0\0\0\0\0\0\0rwせ*░をrつ{*✽けちむ*░をけほせ*▤のつめ+lHのつほ'Xけむちせほwむめ{{w²\0\0\0\0█E⁸\0\0\0\0\0\0\0\0\0\0\0\0のめほ'✽fけつめ+웃のめむ*✽fけほむ*▤r{ち*fXけつめ+▤のめむむめちzせめ{ち²\0\0\0\0L✽h\0\0\0\0\0\0\0\0\0\0\0\0けほむ*Efrつつ*✽けむめ+Efけせむ*▤rめ{*fTrつつ*Xけむめけつwつzつzつ²\0\0\0\0\\✽●\0⁸\0\0\0\0\0\0\0\0\0\0けほほ+Ehのめ{&웃bむち*Ehのめめ'▤のつめ+●Tけつつ&▤bほちけつめめむめめめ²\0\0\0\0VdFlh\0\0\0\0\0\0\0\0\0\0のめほ*Ihけつg$웃Bすむ+Ihけつz'⬆️rつち*●⬆️けつj$▤Bすむのつほちほzむせ²\0\0\0\0HdHh☉\0\0\0\0\0\0\0\0\0\0けほめ+YhのkF$IBdへ*Yhけつめ+Tけめめ+●ˇけ{F$▤Bdへけめめつむめむち²\0\0\0\0░☉Eh░\0\0\0\0\0\0\0\0\0\0けむち*YhこFD%IRDd*Yhの{つ*Tけちむ*●ˇけFD%▤RDd□むちつめむほめ²\0\0\0らEHEfH\0\0\0\0\0\0\0\0\0\0のめめ+YdcDT)IRED&Ydけつつ*Uのめむ*FˇbDU)▤RTD\"むめつむむちつ²\0\0\0らEXE●H\0\0\0\0\0\0\0\0\0\0けちつ:YdCTU%I★YE$Ydけめつ+Uけむむ*FˇRTˇ)▤★TE\"vつつむむめつ²\0\0\0`░V✽F☉\0\0\0\0\0\0\0\0\0\0けつめ;I\56DTE$IRED$Ydけちつ*Eのむめ+FˇBDE$▤RU▥\"dすめめくつめるア\0\0█hDeHh\0\0\0\0\0\0\0\0\0\0のつつ:✽CUT▥)I★▥Y%Y░のつめ+Iけむち*HˇRU▥%▤R▥U\"Ddつつけつつるアᶜ\0@dEdEっ\0\0\0\0\0\0\0\0\0\0けつ{;\56DDDD%IRˇY%Y░けつつ*Iのむめ*Hˇ★Y▥)▤★」ˇ#QDvつのつつるアアᶜ\\░U☉✽l\0\0\0\0\0\0\0\0\0\0けめ{\54SUˇˇU%ISU▥)Y░bつめ;웃のちむ&Hˇ★➡️Y\53▤★■▥⁙RUdすけめめるアアア\\✽EH░●\0\0\0\0\0\0\0\0\0\0けつg\52UUˇ‖▥□Q⧗▥Y\53Y░Bすつ;웃はほg$Hˇ⧗■Q\57▤□■ˇ⬇️★YU⁘けつちるアアア\\U░XdH\0\0\0\0\0\0\0\0\0\0のkFTTY▥」!■▥⧗▥Q\57YdRdす;웃はgF%FˇSˇ▥\49▤★Uˇc⧗YY%bzつるアアア☉TD░hD\0\0\0\0\0\0\0\0\0\0けFTU▥Q■」⁙➡️ゃ⧗■Q\57YhSUd:웃こFU\53●ˇ⧗▥➡️\50▤★Y▥c⧗U▥!Bfつるアアア✽HDE●✽\0\0\0\0\0\0\0\0\0\0bDDT⬆️Y▥\49■▥ア⧗▥UˇCh⧗YE\54웃cTˇ\57●\52」」□\50▤⁙➡️➡️c⁙」」!CDするアアL✽TT✽F░\0\0\0\0\0\0\0\0アアBTUˇ▥」■⁙➡️ゃア⧗■■▥\57h⁙YY\53웃Sˇ▥\57●⁙■▥」\49▤⁙★□c\49▥」□STdるアアX✽ETdX░\0\0らア\0\0\0アアアRUˇ‖■)\49■▥アア⁙!□」▥c⁙➡️■\57웃⧗▥➡️\49\54■!」!\49▤#□➡️c\57■▥⧗⧗UEbアfUEEThTd\0\0アアア\0アアアアRˇ」」■■⁙➡️ゃアア⁙▥▥!■\49⁙★▥\53웃⧗■★\57⁙!\"■\"\49▤#★\"⬇️\57!」⬇️⧗ˇYbf●UE░E☉Eっ\0アアアアアアアアア⧗」!■\"\49■▥アアア\53■■!\"!⁙■■\57I⧗▥➡️\49\"■➡️)\"SX⁙▥■⬇️\53\")⬇️⧗U▥cfFU░F░E☉●らアアアアアアアアア⧗▥▥」■⁙➡️ゃアアアう⁙!▥■!\"!□⁙I\49■■\"\"!!!\50웃\52□\"□⬇️\53\"\49웃⧗➡️」cfVU☉fHU░hアアアアアアアアアア⁙➡️!\"\49■▥アアアアf\57\"!\"\"\"!\49■I■⁙\"!■)!\"⧗H□#\"□C‖⁙\49☉⁙➡️■cfXUhVTE☉●アアアアアアアアアア#★\"□⁙➡️ゃlfアff∧#\"\"■▥!⁙➡️웃」\49\"!\"!\"\50웃「」\49□■C‖#\50H#➡️➡️cf✽EhEUH☉░アアアアアアアアアア⧗▥\"\49▥▥lffffff\57□!□\"\50■▥░▥■⁙!\"!□⧗☉☉▥■#!Cˇ#⁙H#□■⬇️fEHHU✽░Ehアアアアアアアアアア⁙➡️■\49➡️efffffff∧#!□\"⁙➡️Y☉⬆️」\49!!■\49웃☉☉▤」\49\"CU#SX#★!⬇️☉U☉XU✽D✽fアアアアアアアアアf⁙!!\50➡️effffff●☉むちむ!■▥✽☉X▥■#!□⧗☉☉☉☉▥■#CU#⬇️X⁙➡️\"⬇️XU░TUHXdlアアアアアlをアff⁙!■\49➡️efffff☉☉h\0zwあ➡️Y☉DDˇ」\49!\50IDD░☉▤」\49CU\49▒⬆️#□■⬇️TUDU░TTっ●アアアアlfflff⁙\"\"\50➡️eff☉☉☉☉☉せgてwせ▥✽DDDT▥!⁙⧗DDDDD☉▥!HU\49▒ˇ#\"!⬇️UUTUHE░dHlをfアffffff⁙■」\49➡️ef☉☉☉☉HDwwをちめZHDUUDˇ」\50ITUUDDD⬆️▒Hˇ\49B▥#\"!CUETETEH✽Xffffffffff⁙)\"\50▥✽☉☉☉☉DDtゅgせwfzDUUUUT▥□TUUUUUDD░☉ˇ\50I▥⁙▥!SU░U░U✽TdDffffffffff#)\"\49ˇ░☉☉☉DDDしfvvちむ{UUUUUEˇQUUUUUUEDU░‖▒X▥#!\"STTHHUdUHXffffffffff#!\"\49U░☉HDDDUulvlを`そサツおUUUTUUUUUUUUUUEYDXY#■■CUT░HE●HhUffffffffff#\"\"!C░HDDDTUelてlアFく|}メかUUEˇ▥UUUUUUUUUDUTU#!\"CEU✽TE☉✽FUf●☉fffff☉☉⁙!■\49!░DDUEUUたをてア\0▤slgツ>➡️Yˇ▥▥▥▥UUˇ▥YUUUUE\52\"\"\"CTUDU✽HhLE●☉☉☉●hf●☉☉#\"□⁙➡️ADUUUUˇy⁶\0ゅら⁘{vmショ⁙▥▥■■▥▥Yˇ▥▥▥UUUUE□#\"\"CUDTU✽░をV░☉☉☉☉☉☉f☉☉☉#\"\50■▥DUUUUˇ▥▥ん`wvむzvw|メ◝■■■■■▥▥▥▥▥▥▥▥▥U‖」\49\"■CUETU░UhHh☉☉☉☉☉☉☉☉☉D⁙!⁙➡️IUUUU▥▥■ニfらgきすgシテ`ツ}■■■■■➡️▥」■■▥▥▥▥▥U▥■#\"SUEUU●Uっ☉を☉☉☉☉☉☉☉☉DD⁙\50■▥TUUUˇ▥」■~ᶜᶜ`せちwメ◝んw➡️■■■■■➡️」■■■■▥■➡️▥▥ˇ」\49\"SUDUEFEをhアh☉☉☉☉☉HDDD⁙⁙➡️IUUU▥▥」■ニ\rf\0\0らアシモ◜ᵉ∧\50」■■■■」■■■■■■■■➡️▥Y▥■#SUTEeHElをl☉●HD☉HDDD⁘\51■▥TUUˇ▥▥■■トw}f\0らfツモ◜cT!➡️■■■■■■■■■■■■■■▥▥ˇ」\49⁙EUDdH░flf☉●DDDDDDD$⁙➡️YUUUˇ▥」■ヨツシ}テgシgシモモoL‖➡️■■■■■■\"\"\"■■■■■➡️▥Y▥■#UED☉H░fH●HhDDDDDDT\52□▥UU▥ˇ▥▥」■カgvfwシモ~シメモ}lT)」■■■■!\"\51#\"■■■■➡️▥▥ˇ」\50TUD☉DDH✽☉☉░DDDDDUUE‖QU▥▥▥▥■」■qlシ◜~シメテvツツwをf⬆️➡️ˇ」■■\"\50\51\51\"□■■■■▥▥Y■EUET░TDT░H☉DXUDDUUUUDUˇ▥▥▥」■➡️■ゃ|ツ◜リwツモfvシツfアF웃YT■■\"\51\51\51#\"■■▥■■▥▥ETUDTEUDU░D☉THUUTU」UUˇ▥▥▥▥」■■■■i|ツョ?~シツvwツモgをlVろI⁘■\"\51\51\51#\"□」■」■■▥YUUDUUUTYET░DEYUUEˇ★U➡️▥▥▥■■■■■■q|シメツ}vmwシツメ~iア●\\ろY■こ\50\51\51\51\"■➡️!」▥➡️▥YUYUˇYU▥YUUDDE⬆️UUDT)➡️」➡️▥」■■■■■■➡️をw})Alvw♥☉シテ」アア░\\つめz\"\51\51\51#□★■★!▥▥U▥UU▥▥▥▥YUUXDX⬆️UEDTU➡️」!▥▥■■■■■■■イvF」⁙っvgHˇ✽メ」りアアてほj、\"\"\50#\50□!■★R▥▥▥▥Uˇ▥▥▥▥▥UˇTTTEYDDDUU▥■★➡️■■■■■■■yf░ˇ■わf●DU░x。■アアvせ⁷▮ね*\"\50\"\"\49\"#▥▥▥▥▥▥▥▥▥\57□▥▥▥DEXˇ▥DDEUYˇ▥!」」■■■■■■カ⁷VX▥ゃを●THˇxせ•ae`vアをy◀!\"\"\50\"\51\"‖▥▥▥▥▥▥▥▥⁙ˇ▥▥▥DXHT」EDTˇQUˇ」Q➡️■■■■■■■\rl░Eわアl☉TIそjせ■Eᶜllᶜl•■!\"!\51\51#「➡️▥▥▥▥▥▥」R▥▥▥▥░TFEˇQTD‖YUUˇ▥ˇ」■■■■■■▒らlT」ら😐T░░wつv■Dっらf\0k¥■■■□\50\51#⁘■➡️▥▥▥▥▥」Q▥▥▥▥DTXUT」UU」UUUUUU▥■■■■■■■っᶜX」¹l☉░xgせフ■a░⁶らkゅ」■■■■!\51□‖■■▥■➡️▥Yˇd▤▥▥▥░ETUDˇYˇQTUUUU」Y」Q「■■■■➡️ア●」Qアlvつvfツ゜■fh`ゅ▶■■■■■■\"Q」■■■\49\"➡️UDh●▥▥▥D░EUHT▥▥ETETUUhUˇり◀■■■■■わ😐ˇ▥hgせほ\nwフ゜■➡️fhg」■■■■■■▥U◀■■■□IYE░ef⁘➡️」DHDETEˇUEUTEU▥v◀➡️h■■■■■■aアXUわ⁶zvつfツ◜■■░●E◀■■■■■■QU░⬆️■■■➡️HD▤lを「■■✽DDEEE⬆️UDEDE‖☉lLd‖■■■■■■■ア`H☉ᶜgてへzサ◝■■✽hUD■■■■■■■UED⬆️■■■➡️웃ろlアV■■░DEEEUUYTDTEalᶜアT▥■■■■■■カgᶜ●ち⁷vをwはフョ゜■IHXd■■■■■■■YUE░」■■りアろ●⁶F‖■░DUXTTDˇUDT⬆️●lア⁶ˇ▥」■■ˇ■ニツ}をpgw`jて\54{メ゜■AHD░」■■■■■!⧗UU░∧■■➡️😐E☉を😐ˇ➡️DXUTTTTTEETeTfアFU▥▥」➡️U▥テ}らアpvせ⁷すw{zシ□■QD░░‖■■■■■■\50YU✽fT」■UlDアアDETXUETHEDUDe░EhᶜVUˇ▥■YUホ}を☉fらvち{pちせつW□■■✽H☉V■■■■■■!▒TEffFDHUっをアffTTU✽T░✽TTEEFわf`VUU」➡️YUツ⁶XHっアvjせ\0ほせ:■\"■■QHhf‖■■■■■)▒☉░hff░dアアっlfアXDTEX░UUEDTLわh●VUUˇUUふ}\\dろfᶜp|\0をvz¥\"\"\"■■░dFF■■■■➡️ˇ✽●H\57□dffを●⁶アᶜ\0TDUDXHUT✽TUhわっアTUYUUUめシををlをᶜ\0\0`lGひ%\"#\"\"\"EDF✽ˇ■■■▥UDh⁘□░ゃアを(⁙ろア\0\0DHTDTFTEUXEdTh\0VUˇYUUつvwfをᶜᶜ\0\0をvˇ■!\50#\"\"□IXdDd▤■■ᶜI░Hˇ웃アアアアYˇ▒h●!DHTHUVX✽UET●VhFLUUˇ▥UちvgアアらアlvlゅW!\51\51\51\51\"□AH✽☉Dh‖➡️を█Yfd∧h\0アlf●✽D▤EHH░TEFD✽UEUE\\h\\😐UUU」➡️zんをアアlフヤjせ|v」\"\51\51#\"■QdE●☉☉∧I░っ\0dを◀웃hlf☉YHYd⁶☉D☉XefEDUTTUUわ\\hUUUY」wfア\0lメ゜くwょq|‖\"\51\51#\"■➡️EHfhfっU\\dア`ア」■✽h●Dア☉アア⁶░☉HTe●U✽TUEUUEVXUUˇTUyg\0らシ゛■ねむ◀カv)\50\51\51\51\"■■U☉っ●f●YをDhを☉☉■➡️☉DD\\dアl⁸D☉HT●fhY✽✽HTUe\\UUUETUU}ᶜ`サ゜」■つ■カW\"\"\50#\51\"■■Q✽hl●h「U░っLア⁘■■EFDわHf☉⁶DDHEhh☉∧‖\"➡️HYU\\UT✽✽░UUコんらv◜➡️U」■■-➡️」\"#\"#★■➡️Uっlh☉を「XアをL」■■QhXUEhをᶜDHX░●fhf➡️U░HˇULTDHXDTTコ}\0lョE」■■■➡️U▥!\"\"\"□▥」Ydl░░⁴\0らを\0らL」■■D☉aIをア\0EDDffdfTe░HD☉EをD☉░☉DTD▥テ⁶lフ_Dˇ■■}l❎!□■!\"QU▥EfH☉웃ア😐ᶜ\0アアV」■I░ᶜ\0ア\0らTDd░fh‖Y░e●hfを☉☉HhfX▥■■ニ⁷らvNˇ■■■}lサ)■」▥■★UUY☉H░U웃ろ\0アlffF」➡️h●fろらアD░☉ff「I☉D웃●fD」\"□➡️ET➡️EをlH}\0`フDT」■}アv。Q▥Uˇ■YUˇhX░T░ア`ffffをア」diYをらア✽hfffAf●HYV」▥EdFˇ■➡️lf☉HDケむ;こ⬆️■■■}アf。QˇUUˇ➡️UU✽VD☉アを」YE☉☉☉fLiX░らアl●ffをThアl▤HEEIl●をffi☉DTUETちむつDˇ■Yコをl▶_UUUU▥YUE●E☉fV□■➡️Y░H░をE⁶\0アlfffをL□っアlわLゃアろf☉fH☉☉HˇYD☉vむ;zあ■YUコ⁶lフ_UUUUU▥UY░HHh(➡️UU▥Y░DっV░をlf●ffア「YっᶜD\0Fろ\0l●HHTU░X▥EhらlvちwあUUUコ⁷lシ_UUUUUU」UD░☉D」YUUUUU░hアFf☉☉☉fをア⬆️hア●\0HUd\0lDdX▥Eh●UEᶜᶜせむはgWYUUコ⁷らシ_UUUUUˇQUEE☉D➡️ˇEDDTUU░fア☉HDhをアをXをアᶜ`dP✽ᶜF░f⬆️E░HhH⁴ᶜ\0fつせf⁷ˇUUUイらサ_UUUUˇ■UUU░░XQI☉TUDDUU☉h●D☉fアfᶜFfらアFアT	⁶░ffDTU░f●⁶\0`z{つfんP➡️UUm\0サ_UUUˇ■YU‖⁙✽░▤QdHDUUDDUU☉●☉░HfをらlHh`を●T\0hh●をFUd●TU\0ᶜ`すzzv⁶ア⁘➡️Y}ᶜv_UUˇ■Y‖\50Q%Q☉「Y░f●HTEDHUEfHDDfアらう✽lアアlわ\0e●☉を😐f●UUろᶜᶜ|せほjvをア█‖■カᶜ|^U」■YUU‖□‖IE,If●D☉☉☉h▤YUE●H░をᶜ`Yっᶜᶜら\0\0Vd☉░っlHTUe\0アらwwせgvᶜᶜア😐ˇセ⁶|゛■➡️UUUUU□TET%Ehl☉hfアl▥UˇU✽☉Hア\0T☉を\0\0ᶜら●D●HDhlXUUをらららちむめglᶜアᶜア@コ⁶|おYUUUUU‖YD☉D%UHっ●☉☉をLY░⬆️YT☉☉アL░をᶜ●dH\0らlHTEdlTU⁵アらᶜアgfvglアららᶜ	t⁶l]UUUUUU▥E░☉H)YT✽●Dhア@E☉☉IE░hア░fアLdXLわf●HUU░アTわアアアらᶜをアアんl\0ららア」\\Iˇ]UUUUU%QD✽h●」YXUh●をᶜ█Eff⬆️T░☉😐UdFろH😐ろろ😐fHUU░をdらアアᶜらᶜ☉DっををアᶜアらˇFeT⬆️UUUUUわ😐TdTl」UHUdHhᶜ`✽lh∧XhhV░fl☉lっ⁸⁸lh●TU░をᶜᶜアᶜを⁶😐FT웃ををアᶜら\0Ufd●VYUUUˇeア░●Lア▥T░☉hfア\0ら░ら☉VHhfHhᶜ\0lら⁶⁶⁶\0ア\0ららららら`ᶜ`アを☉HˇYらᶜアアア\0░hffFYUUU░ETdを●アYD░░f●を\0\0Fら●Vhhを●を\0ら\0らアア\0ア\0らᶜアをᶜをを`l█`dDˇYᶜアアアらアHっをを●YUUU▥UEflっアUETUdlア\0\0\0\0fE☉hアl\0アᶜアアらア`ᶜらlllアアをアををh●☉D▥Iをアアᶜ\49A█をアをlYUUUE░hfらアアˇETUEアH\53▒\0\0F●☉☉アら\0アらアアᶜᶜを\0▤!□ろをlア😐lををL●T‖⁙アアᶜ、‖⧗eアアアl⁵UUUUE░hアアア⁘UHUUアH#✽hᶜl●H☉ア\0らアらlアア`アP!\"\"★lっをっ●llH😐X\53★¹アᶜ\0P□✽をアアl⁴@UUUY☉をらアア(THUUアF⁙⬆️Yっら●D░ᶜらアアアをらアfア」\"■▥\49il`fっっh@h☉‖RわアアᶜP➡️dっアア●✽\0FUU░をアf⁶ア&D☉HDfH□‖➡️✽アfD░ᶜアᶜをアᶜアアア∧!➡️YDˇBをh●😐lをlDT⬆️■ア●D☉∧YをfアlHˇ\0らTUUUU░fア、░dHU☉⬆️➡️ˇ➡️YっlH░\0アlアららアlア‖□▥U✽T➡️lhろを●`😐░ˇU」Iˇ■YTE\0アをアHU▒ᶜ`T\57\51YUhを、✽░TUEU➡️U▥U░lHD\0ᶜをアアをアを😐」➡️YdHH‖●L`hhhL☉ˇIˇX▥▥▥T░ᶜらlアHT」⁴ᶜ…■\"⧗Teを、✽✽TUDUˇHUTE∧☉Dᶜllアfア`をV■➡️Eff☉⬆️☉ろFlろd😐░TU⁶HUUE░hᶜ\0`アHTˇIら…T■□V\50aうE✽HEUH░HDD✽☉🐱Dᶜアをlを\0●ア▤■▥░●f😐X☉ld●LfXdHEア●HDDっl\0\0らを☉DUˇ\0\0F‖➡️‖&⁙TED☉DX☉f●DX➡️X⬇️H⁶lをを⁶`っfˇ■YdhlhXっdをfHアUh●hᶜl☉☉☉をl\0\0らっ●DTD⁴\0\0「▥F(★ˇEHh☉☉hf●☉H■\50aHをfl█`H`●‖➡️Eh⁴●ろFHを😐f⁸●E░Dhをアlfをア`\0⁶\0h😐H░X	ら▤ˇYU!QTH●░●●fアl☉f∧■d●っをを⁴●⁶fF」➡️D☉hXア☉░leFlF░Dˇ웃⁴アアアアアら`⁴\0FlXET⁵LQETU」YEHh░flをアアff☉っf☉hlL█っらlV」h\0`heL░fDh░lX☉T▥Ilらアアアᶜらを⁸\0😐をTU☉⁵、Y░HUU░E☉☉Hhをア\0らfをアア●D☉😐⁸f⁶lfV⁴アアᶜ\\●DhHeHh☉ThTˇEᶜアらアᶜ\0\0アをᶜff☉D☉ろ▤EhlHDd✽░D●☉をᶜ\0\0lfアlhF☉●`HアFd⁴lをらᶜ█D░☉eF░f☉TdXU░ᶜら\0\0\0\0\0アをFTED☉☉‖Ydlっ●☉hEhDh☉fᶜ\0ら●T▥l⁶lh\0fdF⁵Dア😐Hを\0らE☉X☉TdH░XわHEh⁶\0\0\0\0\0\0llU▥▥E☉fY✽ア●ᶜアfア☉f☉hffア\0lfHˇi\0ら●めᵇ\0\0めめᵇ\0\0めめᵇ\0\0めめᵇ\0\0めょアアもめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめらす{メ◆T」\50め…■➡️ぬめ…■➡️ぬめ…■➡️ぬめ…■➡️ぬょ\"■ゃめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめ\0█dHわ●DUᵇ!\51#¹ᵇ!\51#¹ᵇ!\51#¹ᵇ!\51#¹ょ➡️YろめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめP\49#\51QP\49#\51QP\49#\51QP\49#\51Qら▥Uもめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめ…っXっ▤…っXっ▤…っXっ▤…っXっ▤らYUゃめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめPアうア\\PLうL\\P\\う\\\\PLうL\\らEL‖もめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめ…#¹!⧗…#¹!⧗…#¹!⧗…#¹!⧗ぬアょTゃめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめ@➡️!➡️A@➡️!➡️A@➡️!➡️A@➡️!➡️AぬめめLわめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめᵇh\50b⁸ᵇh\50b⁸ᵇh\50b⁸ᵇh\50b⁸めめめょもめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめᵇ▤f∧⁸ᵇ▤f∧⁸ᵇ▤f∧⁸ᵇ▤f∧⁸めめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめP!QぬめP!QぬめP!QぬめP!Qぬめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめᵇ\0\0めめᵇ\0\0めめᵇ\0\0めめᵇ\0\0めめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめめ",pal={[0]=128,9,10,7,136,8,1,131,2,137,13,12,129,3,139,11},w=128,h=140}
loading_gfx={bytes="\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\"\"rwwww▶■¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\51\51#\"\"\"\"\"\"rwww■¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0⬆️▥\57\51\51\51\"\"\"\"\"\"\"\"rww■¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0ちちちちZUDDD⬆️\51\51\"\"\"\"\"\"rw■¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▥たちちちちちちちZUUED\52\51\"\"\"\"\"rw■¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▥▥▥▥ちちあちちちちちちZUEDD\57#\"\"\"\"r▶■\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▥▥▥▥▥▥▥ちちちちちちちちちZUUUD\52#\"\"\"rw■\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▥▥▥▥▥▥▥▥▥▥ちちちちちちちちちZUUUD\51#\"\"\"w■\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▥▥▥▥▥▥▥▥▥▥▥▥ちちちちちちちちちちZUUE\52#\"\"\"w■\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▥▥▥▥▥▥▥▥▥▥▥▥▥▥たちちちちちちちちちちUUUD\51\"\"\"w■\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▥▥▥▥▥▥▥웃▤▥▥▥▥▥▥▥▥ちちちちちちちちちちZUUD\51\"\"\"w■\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▤▥☉▤▥☉▥▥▥▥▥▥▥▥▥▥▥▥▥▥たちちたちちちちちZUUE\51\"\"\"▶¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0☉☉▤▥▥▥▤▥▥▥▥▥▥▥▥▥▥▥▥▥▥▥たちちちちちちちちUUUD\51\"\"r■\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0☉☉☉▤▥▥▥▥▥▥▥▥▥▥▥▥▥▥▥▥▥▥▥▥▥ちちちちちちちちUUU⬆️#\"\"w¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0☉☉☉☉☉▤웃☉▤▥▥▥▥▥▥▥▥▥▥▥▥▥▥▥た▥たちたちちちあたちUUE\52\"\"r▶\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0☉☉☉☉☉☉☉☉☉☉☉▤▥▥웃▥▥▥▥▥▥▥▥▥▥▥▥▥たちちちちちちちちUUE\51\"\"w¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0☉☉☉☉☉☉☉☉☉☉☉▤▥▤☉▤▥▥▥▥▥▥▥▥▥▥▥▥▥た▥ちちちちちちちUUU\52#\"r▶\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0☉☉☉☉☉☉☉☉☉☉☉☉▤▤웃☉(▤▥☉▥▥▥▥▥▥▥▥▥▥たちちち▥ちちちちZUUE\51\"\"▶¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\"🐱🐱☉☉🐱☉☉☉☉☉☉☉☉▤(☉☉▤웃▤▥▥▥▥▥▥▥▥▥▥▥▥▥ち▥たあちちちUUU\52\"\"r¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\"\"\"🐱(☉☉(☉☉(🐱☉☉(\"웃\"(♥☉▥▥▥▥▥▥▥▥▥▥▥▥たたた▥▥▥あ▥たZUUE#\"r▶\0\0\0\0\0\0\0\0\0\0\0\0\0\0\"\"\"\"\"🐱☉(w🐱☉☉☉☉☉xwx♥웃웃r▤웃☉☉▥☉▤▥▥▥▥▥ちああちあた▥あたちZUE\51\"\"▶\0\0\0\0\0\0\0\0\0\0\0\0\0\"\"☉\"\"□wxp🐱☉☉☉☉▤▥☉☉☉☉x▤☉▥웃▥☉▥웃☉▥▥▥▥▥▥▥あちちあ▥たちちZUU\52\"\"▶¹\0\0\0\0\0\0\0\0\0\0\0w\"🐱☉(w!x(x🐱☉☉「w'▤☉☉xx♥▥▥▥x▤☉▥▥▥▥▥▤웃▥▥▥▥▥▥ちちちちちちUU⬆️#\"r¹\0\0\0\0\0\0\0\0\0\0w\"☉(\"\"\"☉(🐱\"\"☉x▶r★²♥☉☉x♥▤▥(☉▤▥▥▥▥▥▥▥▥▥▥▥▥▥▥ちちちちちちUUE#\"r¹\0\0\0\0\0\0\0\0\0w■wrw\"\"\"\"(\"\"\"☉xwqr♥☉☉☉☉x★)♥「w▤▤▤▥▥▥▥▥▥▥▥▥▥▥たちちちちちZUE#\"r■\0\0\0\0\0\0\0\0'🐱rr♥ww\"\"\"\"\"\"\"(□▒▤x☉☉☉☉☉☉☉w웃☉w☉r▤▥웃▥▥▥▥▥웃▥▥たちちちちちちZUE\52\"\"▶\0\0\0\0\0\0\0⁷\0p('rwwr\"\"\"\"(☉x\0p☉☉☉☉☉🐱▥웃(▤▥▥▥▥▥▥▥☉▥▥▥▥웃▤▥ちちちちちちちちZZU\52\"\"▶\0\0\0\0\0\0²\0\0🐱w\"\"ww\"'\"r(pxw❎(\"☉☉☉²'☉웃☉▤웃x■▶q☉▥▥▥▥▥▥▥▥たちちちあたちちちちUU\52\"\"▶\0\0\0\0\0'▶▶r▶♥wwwww'\"r♥(¹'r(🐱🐱☉☉「 ☉☉☉☉♥☉x▶■q★▥▥▥▥▥▥▥▥ちちち▥たちちちZUU\52\"\"▶\0\0\0\0\0▮w'w\55(\"'\"rr'\"🐱☉x♥(☉☉(☉☉⁸\0♥'☉☉☉▤▥▥웃x▶♥▥▥▥▥▥▥▥▥▥ちち▥▥ちち▥たUU\52\"\"▶\0\0\0www\55w■'#\"\"⁷'w'''☉☉▤x☉☉☉☉☉wwr🐱▤웃xp♥▥☉w▶▒웃▥▥▥▥▥▥▥▥たあ▥▥たああYUU\52\"\"▶\0\0⁷\0\0p▶▶▮¹pw\50\50('(www\"☉☉☉☉x▤☉☉☉☉☉▥x\0\0¹☉xr■☉☉▥▥▥▥▥▥▥▥たあ▥▥ちたあ▥ZU⬆️\"\"▶\0\0■\0\0qw¹w▶q⁷'☉'x\"w▶'w☉(☉☉w▤▤웃☉☉▤y\0pw🐱☉☉('🐱☉▤▥▥▥▥▥▥たち▥ちああ▥ちちUU\53\"\"▶▮¹r■■ww¹■w■p'wrw'\"rr'r🐱▤☉☉(☉'♥☉▤웃▶▒☉☉xw☉☉☉☉☉▥▥▥▥▥▥▥▥たちちちたちちZU\52\"\"□¹\50#¹!s▶▶\0¹w''wwwwwww⁷'rxw☉☉x♥☉☉▤▥☉☉☉☉☉☉☉☉☉☉☉▥▥▥▥▥▥▥▥たたちあたちあZU\52\"\0▮¹\0\0\0qw■▮¹\0\0w''\"'\50\"!\"■w♥♥\"☉☉☉\"🐱☉'▥▥▤▤☉'(☉☉☉☉웃☉▥▥▥▥▥▥▥たちちあたちちZU\52\0▮\49²\0\0\0\48rq¹p¹qwq⁷¹!r¹ \"■qrw🐱(🐱(\"🐱☉🐱☉웃☉\"r☉xr🐱☉☉☉☉▥▥▥▥▥▥▥▥ちちあちちちZU\0■q³\0\0\0p\"w▶w\0\0■qq¹r⁷p¹!\"♥☉rq(\"🐱(r\"'☉☉('☉☉☉☉x♥☉▤☉☉▤▥▥▥▥▥▥▥ちちあちちちZ\0q■'\0\0\0\0▶w■q□\0□q■▶▶\0q▮▮p\0'\"r♥☉☉☉\"♥(\"\"☉(w🐱\"x☉r☉☉☉🐱x☉x▤☉▤▥▥たちたたちちち▮\0p\"⁷▮\0p\0▮¹▮■\0wq■\"#▮y▮\55⧗□qw'¹🐱\"☉☉(☉☉🐱🐱☉(☉☉'▤웃\"☉웃☉☉r🐱▤▥▥▤▥▥▥ちちたちち\0\0\0■\"⁷\0▮¹■■■¹!\51³\"¹」¹▮▶wq\"\"\"r²\48☉w🐱🐱r♥☉☉☉▤r☉☉(🐱🐱\"▤☉☉☉🐱▥▥▥▥▤▥▥たちあちあ\0\0\0p'³\0\"r▶q▮\0□▮\"\0\0웃'r▶■■\"w♥#⁷\0\"▶🐱r(r☉r'🐱웃☉🐱☉('☉▤웃☉☉☉♥▥▥▥웃▤▥▥▥ち▥ち\0\0\0▮▶\0\0\0#'wr¹\0p□⁷\0p\0p▶¹\0\0\"r #▮■'w\"🐱☉☉x'r♥🐱\"w▤☉☉🐱▤웃☉☉x▤▥▥▥웃▥▥▥▥ちち\0\0\0\0\0▮\0\0\0!\"\"\0▮²\0▮q\50🐱¹\0▮\0\0\0\0\0p¹!w((🐱☉☉☉r'♥(w🐱🐱웃☉☉(★▥☉☉☉▤웃▥▥▥▥▥▥▥▥\0\0\0\0\0\0\0\0p'\"r\0\0\0\0▮¹'\51rw¹\0\0\0\0\0\0\0\55)w'#🐱((▥☉x🐱☉x'🐱☉🐱☉\"♥▥▥☉☉▤▥▥▥▥▥▥▥た\0\0\0\0\0\0\0▮⁷pw⁷\0\0\0\0■■\0\48▥▥('▮\0\0\0¹\0r¹¹\0\0\0!☉r▤☉x🐱☉w\"☉☉🐱☉☉(🐱☉☉☉☉▥☉▥▥▥▥▥\0\0\0\0\0\0\0□■\0\0\0▮\0\0▮\0⁷\0\0p🐱)\"x⁷\0p\0\0■\0\0\0\0\0\0\0🐱'🐱☉(🐱(w'🐱(☉☉x♥(☉☉🐱☉☉▥▥▥▥▥\0\0\0\0\0\0!\0\0■¹\0¹\0\0▮\0■\0\0\0q⧗☉⬇️★⁷\0!\"¹■w\0\0\0\0\0prw\"'\"🐱ww''w♥rw☉🐱♥x☉☉▤▥▥▥▥\0\0\0\0\0■\0\0\0\0\0\0\0\0\0\0\0▮⁷\0\0\0▮\"\50s⧗\57	prqqw¹\0\0\0p'wwww'xww\"\"w☉x▒☉⁸▒☉☉☉▤▥▥▥\0\0\0 ²\0¹\0\0\0\0\0\0\0\0\0\0\0¹\0\0\0¹\0▮'▶q\"p\51■wwrw\0\0\0!rwwww♥(wwwr♥☉☉'☉r☉☉☉☉▤▥▤\0\0\0\0\0\0\0\0\0\0p²\0\0\0\0\0¹¹\0\0▮■¹■\0\0pw\0\55sq■wq¹\0\0p\"\"'wwwwrwrwwwrwq🐱☉☉☉☉☉▤▥\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0¹!¹▮¹\0¹\0\0\0▮rw\0\51¹■■▮¹\0\0\0wwrrwwww■p'ww'rwp☉☉☉☉☉☉▥\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0■\0¹▮¹'\0w\48⁙■■■■¹\0\0p■qwwwwww¹▮www'w▶♥☉☉☉☉☉☉\0■\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▶■▮¹\0pr¹q\50²■¹■¹\0\0¹\0\0q▶■▶qww¹wwwwrw'☉☉☉☉☉☉\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0p¹\0▮w▮w\0■w⧗#▶■■\0'r■\0\0q⁷▶¹qwwwq¹qq(\"x☉x☉☉☉\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0q■¹\0□\"¹\0\0▮⧗⬆️(r\50□p■¹\0▮qp▶▶qw■■■■■www☉☉♥☉♥\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0q'#\0\0\0\0q#\50□\0\0▶■■\0▮¹■■■\0■■■■■▮■wq♥☉☉☉\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▮\0\0\0\0\0!⁷\0\0\0\0\0\0\0\0\0▮¹\0\0\0\0▮¹■■▮■¹\0■ww▶■¹'☉☉\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0qrr\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0■■■¹▮¹q■¹\0qqw\0▒☉\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▶r'□\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▮\0▮■\0\0▮\0▮www\0♥\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0q▶'\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0¹\0\0\0\0¹■■\0wwq▶p\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0¹▶q\50▶¹\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▮\0\0\0w⁷q■qw\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▮!□\0\0p⁷\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0■■\0\0▮q▶■qw\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0q\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0¹\0\0\0■■■w\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▮www\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0▮ww",pal={[0]=0,129,133,5,134,143,15,130,132,4,137,9,136,8,13,12},w=128,h=128}
_maps_label=split"hANGAR"
_maps_loc=split("32,85",",",1)
_credits=split"wANT mORE?,HTTPS://FREDS72.ITCH.IO/POOM,HTTPS://FREDS72.ITCH.IO/POOM,gAME eNGINE:,@fsouchu,lEVEL dESIGN+aRT+sOUND:,@gamecactus,oRIGINAL mATERIAL:,iD sOFTWARE,rEFERENCE mATERIAL:,zdOOM wIKI,bsp eDITOR:,sLADE 3+zbsp,sPECIAL tHANKS:,zEP,@tHATtOMhALL,@JUSIV,@NANARK_,jELPI sPOTTER:,@SQUARECHRIS"
_secrets=split("2",",",1)

local snd="36530600324c00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000060100003e0c3fa445d819c0158b1589158515841583158215811381138003800380538000000000000000000000000000000000000000000000000000000000000000000301000"
local schemes={
{caption="esdf+⬅️⬆️⬇️➡️\nfire\023❎ use\023🅾️",btnfire=❎,btnuse=🅾️,btndown=⬇️,btnup=⬆️,space=0x10},
{caption="esdf+⬅️➡️\nfire\023⬆️ use\023⬇️",btnfire=⬆️,btnuse=⬇️,btndown=7,btnup=7,space=0x8}
}
local _btnp=btnp
function btnp(b)
return _btnp(b,0) or _btnp(b,1)
end
function unpack_gfx(src)
local offset=src.h-128
local addr=offset>0 and 0x4e00 or 0x0
offset=max(offset)
src=src.bytes
for i=0,#src-1 do
poke(addr,ord(src,i+1))
addr+=1
if (addr>0x4e00+64*offset-1) addr=0x0
end
end
function draw_gfx(src)
local offset=src.h-128
memcpy(0x6000,0x4e00,64*offset)
spr(0,0,offset,16,16)
end
function next_state(fn,...)
local u,d,i=fn(...)
_update=function()
if(i) i()
_draw=d
u()
if(peek(0x5f81)==1) poke(0x5f81,0) extcmd("video")
end
end
function start_state()
local ttl=300
dset(0,-1)
dset(17,0)
return
function()
if ttl<0 or btnp(4) or btnp(5) then
next_state(menu_state)
end
ttl-=1
end,
function()
cls()
pal()
draw_gfx(title_gfx)
printb("@fsouchu",2,121,vcol(4))
printb("@gamecactus",83,121,vcol(4))
pal(title_gfx.pal,1)
end,
function()
unpack_gfx(title_gfx)
end
end
function menu_state()
local mouse_ttl,mouse_x,mouse_y=0,0,0
local anm_ttl,menus=0
local mouse_acc,keyboard_mode=mid(dget(39)\4,1,8),mid(dget(34),0,1)
menus={
select={
title="sELECT",
entries={"nEW gAME","cONTROLS"},
sel=1,
max=2,
next=function(menus,sel)
if(sel==1) return menus.skills
return menus.controls
end
},
controls={
title="cONTROL oPTIONS",
entries={
function()
if mouse_ttl>0 then
return "esdf+mouse:\nfire\023lmb use\023rmb"
end
return schemes[keyboard_mode+1].caption
end,
function()
local bar="\nfast"
for i=1,8 do
if i==mouse_acc then
bar=bar.."▮"
else
bar=bar.."-"
end
end
return "mouse sensitivity"..bar.."slow" end
},
height=14,
sel=1,
max=2,
back="select",
next=function(menus,sel)
if sel==1 and mouse_ttl==0 then
keyboard_mode+=1
if(keyboard_mode>1) keyboard_mode=0
switch_scheme(keyboard_mode)
elseif sel==2 then
mouse_acc+=1
if(mouse_acc>8) mouse_acc=1
dset(39,mouse_acc*4)
end
return menus.controls
end
},
skills={
title="sELECT sKILL lEVEL",
entries={
"i AM TOO YOUNG TO DIE",
"hEY, NOT TOO ROUGH",
"hURT ME PLENTY",
"uLTRA-vIOLENCE"
},
sel=2,
max=4,
back="select",
next=function(menus)
next_state(launch_state,menus.skills.sel,1)
end}
},0
local active_menu=menus.select
return
function()
if stat(38)!=0 then
mouse_ttl=30
mouse_x=mid(mouse_x+stat(38)/mouse_acc,0,126)
mouse_y=mid(mouse_y+stat(39)/mouse_acc,0,126)
end
if mouse_ttl>0 then
mouse_ttl-=1
switch_scheme(0)
end
anm_ttl=(anm_ttl+1)%48
local active_sel,height=active_menu.sel,active_menu.height or 8
if mouse_ttl>0 then
local prev_sel=active_sel
for i=1,#active_menu.entries do
if i<=active_menu.max and mouse_y>69+i*height and mouse_y<=75+i*height then
active_sel=i
end
end
if(prev_sel!=active_sel) sfx(0)
else
if btnp(2) then
active_sel-=1
sfx(0)
end
if btnp(3) then
active_sel+=1
sfx(0)
end
active_sel=mid(active_sel,1,active_menu.max)
end
active_menu.sel=active_sel
if btnp(🅾️) then
if active_menu.back then
sfx(0)
active_menu=menus[active_menu.back]
end
elseif btnp(❎) then
if active_menu.next then
sfx(1)
local next_menu=menus[active_menu.next]
if next_menu then
active_menu=next_menu
else
active_menu=active_menu.next(menus,active_sel)
end
end
end
end,
function()
if (not active_menu)return
cls()
draw_gfx(title_gfx)
printb("@FSOUCHU",2,0,vcol(2))
printb("@GAMECACTUS",83,0,vcol(2))
for i=0,15 do
pal(vcol(i),sget(112+i,128-11))
end
local height=active_menu.height or 8
palt(0,false)
sspr(12,52,104,15+#active_menu.entries*height,12,64)
pal()
printb(active_menu.title,63-#active_menu.title*2,67,vcol(14))
rectfill(18,76+(active_menu.sel-1)*height,113,75+active_menu.sel*height,vcol(2))
palt(vcol(0),false)
palt(vcol(4),true)
sspr(anm_ttl\12*10,116,11,12,14,74+(active_menu.sel-1)*height)
palt()
for i=1,#active_menu.entries do
local s=active_menu.entries[i]
if(type(s)=="function") s=s()
if(i>active_menu.max) s=masked(s)
printb(s,28,77+(i-1)*height,i<=active_menu.max and vcol(4) or vcol(3))
local hs=""
for j=1,#s do
local c=sub(s,j,j)
if c=="🅾️" or c=="❎" or c=="⬅️" or c=="⬆️" or c=="⬇️" or c=="➡️" or c=="▮" or c=="\n" then
hs=hs..c
else
hs=hs.." "
end
end
printb(hs,28,77+(i-1)*height,i<=active_menu.max and vcol(13) or vcol(3))
end
if(mouse_ttl>0) palt(vcol(4),true) sspr(41,116,10,10,mouse_x,mouse_y) palt()
pal(title_gfx.pal,1)
end,
function()
unpack_gfx(title_gfx)
end
end
function fadetoblack_state(...)
local args,fade_ttl={...},32
return
function()
fade_ttl-=1
if fade_ttl<0 then
next_state(unpack(args))
end
end,
function()
if fade_ttl>=0 then
memcpy(0x5f00,0x4300|(fade_ttl\4)<<4,16)
spr(0,0,0,16,16)
end
end,
function()
memcpy(0x0,0x6000,127*64)
memcpy(0x5f10,0x4400,16)
end
end
function stats_state(skill,id,level_time,kills,monsters,secrets,all_secrets,ammoused)
local ttl,msg_ttl,max_msg=0,0,2
local punch_perfect=kills==monsters and ammoused==0
local secret_perfect=all_secrets>0 and secrets==all_secrets
local msgs={
{txt="completed:"},
{txt=_maps_label[id]},
{txt="time: "..time_tostr(level_time)},
{txt="kills: "..kills.."/"..monsters},
all_secrets>0 and {txt="secrets: "..secrets.."/"..all_secrets,unlocked=secret_perfect} or nil,
punch_perfect and {txt="punch perfect",unlocked=true} or nil
}
return
function()
if ttl>600 or btnp(4) or btnp(5) then
next_state(credits_state)
end
ttl+=1
msg_ttl+=1
if msg_ttl>15 and max_msg<#msgs then
sfx(0)
max_msg+=1
msg_ttl=0
if(not msgs[max_msg]) max_msg=min(max_msg+1,#msgs)
end
end,
function()
local y=40
for i=1,max_msg do
if msgs[i] then
local s=msgs[i].txt
local x=63-#s*2
printb(s,x,y,15)
if msgs[i].unlocked then
printb("★",x-8,y,rnd()>0.5 and 11 or 10)
printb("★",x+#s*4,y,rnd()>0.5 and 11 or 10)
end
y+=10
end
end
end
end
function launch_state(skill,id)
if(id>dget(32)) dset(32,id)
return
function()
if launch_ttl==0 then
for i=0,3 do
sfx(-1,i)
end
reload()
memcpy(0x8000,0x0,0x4300)
load("#poom_1",nil,skill..","..id)
end
launch_ttl-=1
end,
function()
cls()
draw_gfx(loading_gfx)
pal(loading_gfx.pal,1)
local s="eNTERING ".._maps_label[id]
local texty=40
printb(s,63-#s*2,texty,15)
local x,y=_maps_loc[id*2-1],_maps_loc[id*2]
if x!=-1 then
rect(63-#s*2-2,texty-2,63+#s*2,texty+6,15)
local xanchor=mid(x<64 and 63-#s*2-2 or 63+#s*2,32,96)
line(xanchor,texty+6,xanchor,y,15)
line(x,y)
circfill(x,y,2)
end
end,
function()
unpack_gfx(loading_gfx)
end
end
function credits_state()
local ttl,t,creditsi=0,{},0
return
function()
if ttl>3000 or btnp(4) or btnp(5) then
next_state(start_state)
end
ttl+=1
end,
function()
cls()
draw_gfx(loading_gfx)
local i=flr(#_credits*ttl/1200)
if i!=creditsi then
t={}
creditsi=i
end
local s,fadein,fadeout=_credits[(creditsi%#_credits)+1]," ⁘⁙□■▮","▮■□⁙⁘ "
local sp=""
for i=1,#s do
t[i]=t[i] or -rnd()
t[i]+=0.08
local st=fadein
for k=1,30 do
st=st..sub(s,i,i)
end
st=st..fadeout
local j=max(flr(#st*t[i]/3))+1
sp=sp..sub(st,j,j)
end
print(sp,64-#sp*2,32,15)
if(ttl>0 and time()%4<2) print("FIRE/USE\23MENU",38,122,15)
pal(loading_gfx.pal,1)
end,
function()
unpack_gfx(loading_gfx)
end
end
function slicefade_state(...)
local args,ttl,r,h,rr=pack(...),30,{},{},0
for i=0,127 do
rr=lerp(rr,rnd(0.2),0.1)
r[i],h[i]=0.05+rr,0
end
return
function()
ttl-=1
if ttl<0 or btnp(4) or btnp(5) then
next_state(unpack(args))
end
end,
function()
local src,mem=loading_gfx.bytes,0x6000
for i=0,#src-1 do
poke(mem+i,ord(src,i+1))
end
for i,r in pairs(r) do
h[i]=lerp(h[i],129,r)
sspr(i,0,1,128,i,h[i],1,128)
end
pal(loading_gfx.pal,1)
end,
function()
memcpy(0x0,0x6000,8192)
end
end
function switch_scheme(scheme)
local s=schemes[scheme+1]
dset(34,scheme)
dset(35,s.btnfire)
dset(36,s.btnuse)
dset(37,s.btndown)
dset(38,s.btnup)
poke(0x5f80,s.space)
end
function _init()
poke(0x5f36,0x10)
poke(0x5f2d, 7)
cartdata(mod_name)
if(dget(39)==0) dset(39,8)
switch_scheme(dget(34))
local addr=0x3200
for i=0,#snd\4-1 do
poke2(addr+i*2,tonum("0x"..sub(snd,i*4+1,i*4+4)))
end
local p=split(stat(6))
local skill,mapid,state,level_time,kills,monsters,secrets,ammoused=tonum(p[1]) or 2,1,tonum(p[2]) or 0,tonum(p[3]) or 0,tonum(p[4]) or 0,tonum(p[5]) or 0,tonum(p[6]) or 0,tonum(p[7]) or 0
local states={
[0]={start_state},
{fadetoblack_state,start_state},
{slicefade_state,stats_state,skill,mapid,level_time,kills,monsters,secrets,_secrets[mapid],ammoused},
{slicefade_state,launch_state,skill,mapid},
{fadetoblack_state,credits_state,skill,mapid,level_time,kills,monsters,secrets,_secrets[mapid]}
}
launch_ttl=(state==2 or state==3) and 1 or 15
next_state(unpack(states[state]))
end
function printb(s,x,y,c,bgc)
bgc=bgc or 0
print(s,x,y+1,bgc)
print(s,x,y,c)
end
function padding(n)
n=tostr(min(n,99)\1)
return sub("00",1,2-#n)..n
end
function masked(s)
local q=""
for i=1,#s do
local c=sub(s,i,i)
q=q..(c==" " and c or "?")
end
return q
end
function time_tostr(t)
return padding((t\60)%60).."'"..padding(t%60).."''"..padding((t&0x0.ffff)*100)
end
function lerp(a,b,t)
return a+t*(b-a)
end
function vcol(c)
return sget(112+c,128-12)
end



__gfx__
1c900da005488008000060d78602c0de0a1281ad4050a06191d1c038a5080c0615816b00586c2a00381c628bc050834081ce9d020b632ca2810098216080080c
ae018401098711129c0106920041224212512041e2c381b80649406e540390a8b016212a040124181c2084c9c5020040d878026808409040c2841202902f2c33
31409340428102061c803c34e78780e8f01c1f1283e34075280a28000283e3407c5403c406376024b380da401238024485036a6641d034229099f8c02129d128
3ac1044930c8dd5b2125911c2048fb43019805b059008482240c24902011ac018a05180c48a240e24d0a16d625181001a1b1dc108485c680b8d0161b12c40a11
d4a00830416bb02cc020616e018c720051e8018907280c5833c477089ee043d1a1c3a2a1cb1cc094016080080fd201ea034e51a7692ae72048fc380778085400
4022201205114018980680c54804012226f36f36f363c0b41500410888ce0119d1223b3502051980d88a6300e0088428005423402223c351203196018b847802
44104092a01282154014b826806449040b2a4128315601cb827850e50e8032d32d112021e2b003001d0010a8e0901d5312c46de78866816020f322a9412021d6
010b86780844481a897f0138010b812808445815268894c0131f197f92197f2a3fe3fe104ed7ed30acb008971de026e114c83408d34267824c22c8c61b5a126b
1244e81a8518005ca24089509c1263934c62746498b4e017b615242e6c24c1340c2ead34cac202004c52788338084cdd288f598d021f9812e902061f5c15b52e
b834c7c74edf117ed7ed7ed3060097f97f33d2e7824cb3404914216824243484868090c010948e7490d0121416848140c212e36726c1426c784c8f0981f12170
642e0cfeff62ceffeffeff0c30c18704224afc084c36098fc021b905248184a62094d4029a8144a820400425b0842187312c2424022408203234458c78c7cd7c
d72f76c7ee71d30809f09f6cf6cf6cf6cf6cf6c41d2708cc7ce484ad9094e010b4608082cb427b484e4c09cc03c36b2448c93309ca0109463816073116425e62
4acd4849b9c89492731252134a4c741b30a267005ce29b8db8d1041bb8c26f2641536925c020492da025102069adc01e1d7125902049ac0109451800352ee04a
ea284d558cc29a9812d2134a5264f294b4c0969812d40206963a058f99158f58f58f08a0f333a0fb0fb0fb0f78f78f78f10d0f3081ef1e4132b3334ad9684b5e
09e00109429d040084748005a314042d912069e20109490fa3d09e7a12dd1206911f12e2c3564c78c88f0911f1232e32f02d3464c78c88f0911f1233e3acc3f3
accbccbcc3e0accbccbcc10699799799fccfccfccfcc30a9970033f3392a4eca484976092fc025102069a8010587c7384528005a2340425502041927001009a7
c025f812422a13134a52684b4c01d9992d2134a52684318085a92cccc2cf2cf2cf2c70458f99158f58f3cfdd158f58f58f58f3cf3cf3c92646f2184b3d096bc1
2d10202942b7a04a324082d902029ec010b4718084a487d9684f3d09ee010bc88f0171e9232e3464c78c88f0911f19709e1232e3464c78c88f0991f131e31e57
031e31e31e31e31e3182a5e4668cc6c099d8123912021523b1046a04082351202996010bcc5c017293c346104082b01202954010bca8f01f220010018c010a0c
440112a10200951ca311224c685e55403b3408224c4858c60820c62044cedc10836f8902042c7ef0f9367fe8112e7f789d31a7cceed3bb76f8f11002fcedcf14
2cc80000000489116c440340442526a0e24cee3d228b232cfb380e207ef38a20f34c34c34c34c344102f0b5600c8a51e010ab81b326c489531c15cad1116d9fa
803b63ccaa51bc108bd0b5670ab80e09210c5407c898c0a4a41e1c5c3cc6a54075648d5301c506ce6ff7887887887887887d2a84d6a0041b691c1878c2d52b45
aa6592c56be299a344bc45da3553b69d20048e4d6ab878c4109400246a0f898eee4a0941c582557a54075648e6501c50a477ff78878878878878878088014ef4
4400b00741c320387102a34111420002cf80e0e0841cd20102444892c01022c8ce1009d314f12e12e12e12e12e12020d35ffa3c0eda7111001e5d77f76407070
4c40eef480dfb02aff70e34c34c34c34c34cfdfb87014ff6db8800009aebbb30e5407f76207ffff74ff7fb7887887887887887888ff000f000200cf33b00c060
06cc2c3df70708f060bfefdf507083ffe7deaf7fc1c1083cb0d5872af010f4ee283d1122448ecd727abb00c4ea0cc2ac04f01f01f01f01f0150dab3440cad5d0
12c06dcada0e20da7dea9d0ea860331c3663002cb5c60040718113100d1f12e12e12e12e12e12e122f901c3f90c02481cbbfffc09006cedffd7e34af7771c3ee
3002eb0c3ef0080e2078f200aff34c34c34c34c34c34c34c11bd0bb65ce0000921ce89013861136099a2461a1e462093a0180d12a07118cd83c08801022c0bb6
7de0048800022473b673b8241cc818edf01f01f01f01f01f01f01f01004872c40132a0e19a2328b1c8d4211c506c69d53e1e366da77e78878878878878878878
87887887888080f59b6b605cea951b2341446ad9fb0952b00001006c978d4992352847122c1ab9011c3448048ec116890ee0d5407480624c895b3008b3440067
393a0108348e9f01f01f01f01f01099a23c814ac0111c50255895991c5229f8d5331c52c54ac13b1c922978c291c7383048c091235870720012c3bb30e487009
1501e2229b83244e00629b00e054fb78878878878878089966600066f0c04459955dabe43240dcae6dd1cf1df1289c7002b7bde34c34c34c34c34c34c1088110
1a367d4407b95d566d6480280b56755bad89435aa47963db3d106599a666ab4d4c0885d5ab991b6b3a60089555ac891b25ba7008d1b5ad899e6b51d1674dae6d
593061008855daa4b9aed6c520b56b4d61798555a7dc430bdaa71000260d3443e500007136739b8bb81e0df502c40f0b3c7ce078938020e32658b07006ddca91
e1638f0f10e60c6077e0264ca100102c838030c79f8d003c7261870f0e0670c8853e2048b00e1cd343ce0770e62e22838903b14166393487128813b6d5400003
06583f1e120ac1000788800e1e0d39921fda26a7062e2e318308a0806c4e8018060e11340c3422c62c02eb3808340066a6524a152244444017fbd843c4b86780
6801e4dcbe820a2baa184c8d200e3441201645fc008b316cc858688011249a8e65da2596070d25d8998055241c188903424c8503707022080922080707064001
e04488407012081fb1381f580104cf361229c94039f39f21029fb8f0355724aa10440328340248d921362e24cc8dd019060b32040442aa6532cdcad90e4bbaac
e0f13311867cea925b2c9f810006b47bd1db6248b91006755bed8f0b126108a255abc49e15b22008e6d56bc63b2bd6c38347ba535111911ad899e6bb6bcca953
0cc2832204c892b11c1ca5da95311c5ab5d8dda50311e1ab4d4fc405b890d11353012402cc6d04072801367c6d26b91316638bce0f81b80e41b6c5caa65b1c96
b4cad56d67383044378d25baa2830c8d15b6bd69ae0e43bd00b411d96a61045b6b0f43d2accaa6dd1c126d41f55daa2c3048911b9f0ab2930c8d0e3f80676e36
70ce8a0e32640424c238d01162ec35fad6e1f187f1a65da82b1fe1abccea58d51361008a531666e08f8000066c6df38987700026c69d9378124b11519501c9ab
cea90e0b8567de4264079994ccbff01f01f01e2d05bab00081be7c06655d37080316a4d881bb7e926b3287440ce7670cb0ce798131da07d902ccaa513672e3b7
14c0f05b67a08f434d65cc8540f44043c288edf01f01f01f5e6e16c3cbdca17e1c148784a803e22c489d392e1c7cea1713120c3e404da07ee7916755dd44d500
70066d69a5312c54447ca2ef24476c7c410f030c30046185f5f033c7c08d133675c895b3624041389d0f845000cd187834a6817e0c1283ce2f1319106cf814d4
720073e6c9f8d2b1de85101442c18b8812a0282b80eaccc15a828612000c50cb78997f4e10248790407270e3cddca884f4036748ba03b622d38fa1731de12600
080e3d90268b3f1009409009713102cdc000136008784088bf03b60e201c8810e26da791000e3c74c889e9001330560361170cd5ce334340f0107c92c7a38b37
013222318f85fc70eec363244cf64d30f83d84440020ec1263ce417891336c7a340443890119019801c1cd3810c07fd2cc68ce886400f809d1785f70b8512122
4c898e3c4fc82a0cf0113166253183f1bb634ccb32f8d105b6687cf2c010f0b5a6d837701cd3c04cad96300160a702624c8910e6cfd3c83f82386043363a33ee
08fc448d95020e626b3a012c3a214088031665d6d420ffa0ee22a1a187d0584dd54fb788788c7440700f5840e7443c81591491142c1407806c040e3cdd044730
701f319a9908995cd50465404422008ce2000cd04777014071088acfcab3a62e0170e950114b006c78e087805124037d1a98cea038f380eaaa84a913a09cb4a0
52101539415d01e01bd38c96995c002d570ab213d1ae81c4a66801884e820bcf00e3cb026a7834900f8a3a28d7390aaff81f9e8aebe38886a4eabdc7f81dc864
e05650cb03487a317f810019ea111928180c36e5210b17b4a9b7925846034cb67d7ed20730d1300669b536f3a31b30ae02a1a2234040467422cd459060b0f8f0
eeb40efbd369301d059319b956c9902228b10082d51c30a9578f78840d788788788788788788788788788788780133201ec0c890390e602cc8958f013269c2c4
814ff78878878878878878878878878878020100df34ca70af78047f01817100c4244181094e91cf01f01f01f01f01f01f01f0130281ab5281ae703060c21141
e004007c84a84850688fdc0d1ef01f01f01f01f01f01f01fe71001c812b00ab722a2de3402a432234e70e34c34c34c34c34c34c34cd2484b50bb11206dca9d01
1331d306de08d81d6ff01f01f01f01f01f01f01f01f01530df3dda062002a7bf70c858ef503dffdffdffdffdffdffdffdffdffdff1245fe1fe11bddfdff12e12
e12e12e12e12e12e12e1242a30038b876006071c800c0eff8f01f01f01f01f01f01f01f01f01f01f01f0141016a1c7dfe12e12e12e12e12e12e12e12e12e12e1
2a281748080699020b0949e000b0519925888c4e08599151914594a80004d28040055912c1b4038c000111c33c90009414443e233246805661791c1839a58330
0aacc892dcdda8a8868a1a0e8c880e26a4584e52355a2299348731967c01c860ce31f12e120022479860f001a61c3449a60798c9180e6294daa22c354a4d98cc
44221c0b501c1259ac020594f019453e2201891809abc9350cc4035902840066ccea32a9991194bc86c0e8a482de12f01f01f01f01f01f01f01f01f01f01f01a
be319153024a4413e49c1ec44643424802e4a24252bc83e4aa421780211004ac558464128830612a1513be12e12e12e12e12e12e12e12e12e1204546a081c19c
1c3380c12cb94ac80e1998328760f34c34c34c34c34c34c34c34c3409a13366c4980556a45381283ed128b9a21566453c3992590ec874aa1f44deff34c34c34c
34c34c34c34c34c34c5484d0560e22984073f0194238b548c4991c51d0235a4fe78878878878878878878878878878089900f01f01f0134312a454e488055221
cb423248a0519911c4c8a648035a242560f988c4e029235870fac80e42a45888c491262408801d0e099222838a68709433e6ae4d370f89367d63efdd9b3c4115
ee03b32001c96e131a30044383dd122c025999912243d134202cc8911566c403140a6c499239a10c81e03414d8684591448a215293c022540519210845991356
64350b41a69a0109b40453c324aab22908a54694122120fff12e12e12e12e12e12e124643c67eb241d48490f131223874a25d0e632d711cd25bb028b5a8c4991
c5235688133c47302c04680f0ec5c80f011c725228356a801e4575284ecf788788788788788788788788788788055661008356e4601d01411285231192128cd9
780e1f022341cd58b8011dff12e12e12e12e12e12e12e12e12e12a225236e096ec2c9b707b1f0e533cd3c760c34c34c34c34c34c34c34c34c34c34c34c34c34c
34c3484e48dac413122235640f094911124446a8880622118c7242383220487072598109198444220322262283240211483f192128862e3dc9f77789544e22a7
c0035629419550e81421562458429413e0882336645313460e0a61c1c4320976034044912756a128453404815566131c431288215aa9091c1423532c33524a09
c808c10aa4554a41a6140109448a13d01a46827c078ce843a8642955945bf10fd5da16f712a89387d150f893471c3683875234e0f63a422878a1d0e41e564882
94181c56494a80ee1c562988c0e19cd2248bcc0ee130221d3d711c5254a4f543fa91e312a2c38733124446a888919912a4446ac01e115fc0128988f11119118f
a1448429413110cc89644ac80ec01872880c6888902a3c16628399251a2429fc7762294f0eaedb28850422453e12405660705d28029de02588607414e624076c
20111113c131c3228b238b7406c445504f0ecc482b08813844220dc4406e2253336c3604a4c0a91381309b0130da10344acc80c0e84080184980e8818efb8b0a
2237b1ad0e23ab3231e62bf246405c974278c8228f141110e2c9bb1fe180b8060ee5d10d9b704077885891855a61cf12e12e12e12e1263d1bf11a96244a8ceb8
0ea6085180ec650e1df0983cdbd3a1e34c34c34c34c34c34c34c34c34c348137000a041224c891c48819f5302241c12c103144000d931f98303886203083894b
d0ebedfedfedfedfedfedfedfedfed5c4c983f0090a008800ee88200b33dc02af4f01f01f01f01f01f01f01f01f01f01f016ff10e12e12e12e12e12e12e12e12
e12e12e12666de78c8aa0e55b66a8d34c34c34c34c344277dfbaf071fba63875f60f892d56e348d61b2b31c5e7c63b6b3d49e7cc8a66dd6967dc895d6cc479d2
ff6b459da0e0ddabdf8955dab3982a12374d6804e63b6d599167342995804d5bee0fc812551fba6de4af44347e8da1c533954198a66355650f2e49dcc4ffa316
6e9de1a23231117249ac45a8f01008034a2b666d483516b47707033dd66deaae9605612116d2d2832a885b9e0fada435ad85b95b5aa999a419581dc1181274c8
c655e7c69e25d28019845be77604522244824a8f5b36446407022e9efdf8a4e41c909dfbf29c0928301271ffa31b074620589016f52813311840802004f10801
208002d91c8b8a1c4e7247cf8990e6fb675558f7886ae788788788788788788788788780aa04f140c819b25a5298f707002ce2b47507147c40255ac80f4e4481
09a2592e3a389112802b459c80e0ce00832a49929283000041e02446c0247e482ee346610c96042e8c346520407004e00d3124cfd6270e49112f38312007e492
11c900148c4142238b04253a9c328b082556a2d383309098a04cc401480900c4113080314801288099017480c40b03366c98850644024a0c0ec8036800610144
00011117788920c12c02da3833fa38fbe6b6a76237a3830832f8e18e8c3ba10c958f7f91891841c7e32c7db70facc0e1f9aa287f50248540780f1ee082870207
c0ed8e5f0012c76d228bd740f8f019df11e5224650f89900f01f01f01f01f01f01f01f01f010431abc928719b8455274e486267e12b479ac0e444c9058c25926
240002c09aab3ff34c0c488811021c34812399016c4090370791644090170f02244872401350340f7c06c348727e8e04cc928312b9134c912507024e26645021
e8c40a0312c625016622090014008620012cf38084991c8a26d0913275a4b421f9ca0048d7e328b0a36209a2564872722c0845d271332401469a2911f18d1007
4492352507000082c1488c8148e7c15f123b00a410217cb584080e008c10a724889a54e0c92324e4072400ec925228310280992844607184a64397407105aac4
5af01d16a9cf5d0e3311eb6c3875660f894551cb329125228348f077041c3018360f64fa10801e30010407b980e13134997d2baf228b0224c8b68816107240d0
27f010081c96c11e9660724280b891c9c983e76040838c1a36f074480c93206e01c919077009e390c4c606c0e4e36600002401c3083871c52720fae0000fa813
8b0176324f270008938700a3a1c97ed06f01f01f016381ea8c387c0d3fa1e0e544feb89ed7ccca6427b1a3580e63c3911c33911d3c9487071081f4e83c91c5cd
fe98b74507a374001c59b0b001c57c80038be81106f524fd7408862930060720f0ef0f887c2680fc0ebc6400098f44f4075a3200e41e91cdd785c466872dc1e6
3c4c8173464102666438b35555459617226298bba499aa460479a2c9bb88000ee0154227ee108c1122f80e059aa492d491082c2466c78a411098b374148244ac
4ee0c9b3788f444c1383559c418cd7f38b348ce4880d3d1024e4270848c3621262604c0000e5400d124060440e2311044083c818e12a2b2874a25d0e6354b464
07b8c1e80e6953711c5459aec5407a9c5804482283253405f1a919a4b6838bb84aa6255ac04ec3446c489414d314556c054a640488840c9e09923e882224012a
0e0194b01dc06ff788788788788788788788788788788f9f744fc18883f99880e2e4148002000060f78f22f0ef0188fa0f50e1c7862e70a70f78f2f90e1841cf
1e3c92c7a99dc4bb607177ee0112044e42c1004c01080012030024f0e4e00193603277001301591e1961012c92c30000c0304e2c3833c109a071ec12a38b3f4a
ac328b8782369c33a101000954d85884ee08030009a4d8abc0ee04283492339e298b30b410aac415847e0cd2d38a6234a301b0e0a9201a70703ebac044112355
5a6457077992340177aa100aa40127eec1566008c8064882220001dc704488882822896e393681ca700c0aa0648e168017a06c228bb0383507040000c9b37219
5351c15311c5cd1150f802412256587507a2dc2000022a15641640789111d2166200d4255a5a438b469ace380ea0a8e380e4313851f4941d001e5ba8cd383d0d
06507a1f0e5331c9003bb01e0160712f92c0e5801c57041c56cfe10260732fc880ea0ca9e008595662839368f04c0e6c6480004f0f6427d01cd0828700160000
82a73870878f006481c1c72601011c4e0431c90002000881e514100002c90faf0cce68e001870737a8600cc0ab22021130b0e608c008164881e0019310026149
7800d1003e92c3540cd901140589174e81c5091b3778e57813000a31006d345700c86c0e204c1ac03a1125c54271004e5751e91f41f101006435076767a76070
2211211007ce401182a40ed08b340119f52209342149090050122e49e900122774e1591c03511f19995618c9b7d6e16447455044e0c12c32a1a1211c25240880
d1878724c4d4841899881101c91941851f09811fa0024b26110a124e0d9bb9900434cd15407b17e12c1258791c070191c56c193c0111c5664027a8f633c19b70
f81c0eb1688f6385b11cd660227c0e94080fd4f13e3a01ed9f1013872d78acb060220166212485a1d5201cd469968f845d50d13540227850901226c000003274
16613146c4818b3423b2609b05a9871312443cd12a436206ce261284212a842902a730b0e0b14c820001173166da05d284018c5c8952920a00002f084cd16407
24444c1121782fa0e03c8028311999e790af01f01f01f0170299f12e12e12e12e12e12e12e12480d0f87162b3721012c11c0e548cd3aa00166e80138b0832288
1d400ec3836073074c013d92c38314fd7a0e043c9ea235208b1a06600024550facceff01f01f01f01202452c54a2332012c4ccaa180e69a4d824073c45da0283
10162e4201150726648c7c681fe989704246d090f0e00945409d528c34200002cc4e8c1c2634a0080f0a2c111b952a9202584244836796e472744e0197c42207
417e3001a3748e5d40983124e41c5c9833644c1c5881da543c1c500d032c66200fc1c1f9f3ab0014cc6e8e0c4016aa1022cda1043681250cd48aa8e119f320c5
4cff78878878878031dfe1094d89483301a64728b14215a61cd8806aae106c4312881337710914889a02230812605a03399c9de6070029a4598295b31c9c35a0
1193b390c1a344889201e100122278003c040700714c1778ff30932827288c90316a0e14c6638b83247ee1c5001934484883c3187074244a0224ee01a0227008
37288f31883c383511204e41e1151539c7203e98002f80ecf2cf8095a087440207e12252cfe78878878878878878878878878878030f07d0e30855e12e12e12e
12e12e122452850803dda126cc82440353a61c34411b280f20c8d13ff3480266441c904000064cc9882100010108011fc4e00b6100042e40398215a91c10d1a3
c019444e42704c0048e9188240174e8262b19b347440138118362ee8c38b2b183162e8012200837c8e0e4c12833a20a787102ee019312f8e44c801204a0e2e41
c19801e98d3b00068770700a4e2881911e15e91b80803eef002992c340a41148c0ee1c12020104cf878878878878878878878878020a0354edaa682874422c0e
1ee2d38702a880e10803a5e34c34c34c34c34818051901cd2d891180e62ac43c74a011c48022000162cc100883830332e0ea8080e444889b0d5c245831624e88
0a2b500c40a322eec11a25000429327788019b4e48c0181c08c124a7880ee824407c2f4111e0c901687200e4c111324e0110003828317fae4081510965f34c34
c34c34c3440058f28c0e5021cb043afbac34c34c34c34419f0720f9f0ec892cb2830132f0e28e0193707fa7047481e3881a70714288b111c50c932469e1c5080
12f4141c502483a0815e32039b343eb968e34c34c34c10015201a3cc85607384ba6528b18053a91e3aa5127a0144cc150222848100006c409ce856eeba0881b3
a131680662402248c98b34482c490bd5b48098064e944008913c4401b81125210240244e367982d8c1004c15c4078c80e008c322065a006a302a5820e2c1a36e
ae20462029564c5f90c1f4078180e408d4187114f01778e888340714c000801c5001a36a0f6080119787307e86828b10127431dd02048a210b1c024660fcf978
8788788780101a21e22599118016266578b2414a253a01ed0355b280e404898390c9e24c898099ddea0e04262097f02152166d23f0909004d852943c46446070
152a2d121e1b21c12298c67895bafd9cd19374ee1d90c1507488be57c01c1be509831248e8cba3193264809035072623bc11ab1e0e48387930474c1c9c903140
88882833901227c0e448011004f0f40ec97802cb026e6207340000ef610c0e4e13b90054ac400c3555a6007e11c103201effffffffffffff340fff8823dff192
__label__
gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg
gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg
gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg
gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg
gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg
gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg
gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg
gggggggggggggggggg9a99999999999999aaagggggggg999999999999aaggggggggaa999999999999ggg97aa99999999ggggaa9999999a9ggggggggggggggggg
ggggggggggggggggggg977777777777777777agggggga77777777777777agggggga7777777777777aago89777777777aggg97777777779gggggggggggggggggg
gggggggggggggggggggga111j11111j111j117agggga11111j11111j1117agggga71111111j1111j11aoo271111j111aggp791j111j1aggggggggggggggggggg
ggggggggggggggggggggajj1j1j1j1j1j1j1jj7agga11j111jjj1j1d1jjj7agga7j11j1jjjj1j1jj111a2o7jjj1j1j19ao87p1j1j1j1aggggggggggggggggggg
gggggggggggggggggggga1j1jjj1j111ddj11jj78gajjj1j1j111jjdjj1117op71jjdd1j1111j11dddja28711j1jdd1pa29ajjj1j1jjaggggggggggggggggggg
gggggggggggggggggggga1j1j111djj1d11j1d1782aj111d1jjjjddd1d1j17op71j11d1d1j1dddjd111a287j1d111d11a2a9j111d1j1aggggggggggggggggggg
gggggggggggggggggggga1d1jjddd1jjdj1j1d1782addjjdjj1d1j1jjd1jj72p7jj1jdjd1j1d1j1d1j1a28ajjdjj1djja2apj1jjdddjaggggggggggggggggggg
ggggggggggggggggggggadddj1j1jjdjd1jdjd1a82ad1j1ddj1d1djdjd11j72pajdjjdjdjdjj1j1djdda28a11d1d1j119aa1ddd111j1aggggggggggggggggggg
ggggggggggggggggggggaj1dj1daaaaaadjd1dda82ad1d111aaaaaad1dddja2pajdjjjjaaaaaajjc1j1a28adddjc1j1jpa91j1djjjdjaggggggggggggggggggg
ggggggggggggggggggggad1djdda2oooajjc11ja82adjddd1a2oooadj1jjja2pajdjccdaooo2a11c1d1a28ajjjjcjd1djap1j1c111cjaggggggggggggggggggg
ggggggggggggggggggggadjcj11a2h12addccjda82adjc1d1a212oadccjdda2padcjcjjao212acccjdda28adccccddjddaddjdccdjcjagggggggggggg2gggggg
ggggggggggggggggggggadjccdjao1hhajdjcjca82acccjcjao1h1ajjcjjja2pajjjcjda1h1oajddjcda28ajjcdjjdjcj9jcjdjjddcdagggggggggggoo1ggggg
ggggggggggggggggggggajjjjddao21hajcdcjda82addddcdao21hadjcjdda2paccdcccah12oaccdjcja28addcddjdjcjjdccccjcjjjagggggggggg28o2ggggg
ggggggggggggggggggggacccjcja8211adcdcccap2acccdcda8211adjcdcda2pajcjddda1128adcdccca2pacccdcdcccdddjjdcccjddagggggggggho8221gggg
ggggggggggggggggggggadjcdcda8o11ajcdcdda82addcccca8o11adjddcda2pajcccjda11o8ajcdcdda28addcccadcdjjcddjcddjcdagggggggggh88212gg2g
ggggggggggggggggggggadjcjcca8o21accccj1ap2a1dcddda8o21acccccja2paccdccca12o8adcdcd1a2pa1jcddadcdccccdcccccccaggggggggg18o11oh121
ggggggggggggggggggggacccjcdapo21adcdj1oap2ao1ddccapo21adcddjjaopajcdddda12opadcdd1oa2pao1ddcaccdjcddjcdjdcjdaggggggggg2oo12o2122
ggggggggggggggggggggadjccccap821acc11ooapoaoo11cdap821adcdcccao8adccccca128padcj1ooa2paoo11cadcccccddcccdcddagggggggggo2228o21o2
ggggggggggggggggggggaddcdddap8217d1ooo8apoa8ooo1dap821accjcddao8addddcda128pad1ooo8a2pa8ooo1a9dcddcdccdcjcccaggggggggh8o2o8o112o
ggggggggggggggggggggaccccccap8o171ooo8papoa88ooo1ap8o1adcdcdda88acccdcda1o8pa1oo88pa2pa8o8ooaadccccddcdcddcdaggggggggh8o288o122o
ggggggggggggggggggggadddcdd7p8o17oo8888apoapp88ooap8o1adcccdca88addcdcda1o8pa8o88ppa2papo88oaa1jcdcddcdccccdagggggggg1o218821o22
ggggggggggggggggggggadcdccc7po27ooo88ooapoa88ooooap8o1adddcdda8oacdcccca1o8paooo8ooa2pa888ppaao11dcccc9dcdccahhhggggg221oo812o21
ggggggggggggggggggggaccdcdd7827o88o8pppapoapppp88ap8o2accdcccapoaddcddda2o8pa888pp8a2pa8pp88aaooo1cdcdadcdcdahhhhggggoo18oo18o2h
ggggggggggggggggggggadcdcjc727oooooooo8apoa88pp88ap8o2adcdcddapoacdcccda2o8papp8pppa2papp98p7a98oo1jcdaccdcdahhhhhhgh8o2882282h1
ggggggggggggggggggggadcccj1778888p8p888apo7888pppap8o2a1cdccc7p2acdddc1a2o8pap9pp8872pap99pp79a888o11dadccccahhhhhhhh8828o2oo212
ggggggggggggggggggggadcdj1o788888p89ppa9987pppp887p8o2ao1dcdc7p27cjcj1oa2o8p7p9998p72pa9998p72app888o9adcdddahhhhhhhh888o228o12o
ggggggggggggggggggggacc11oo8o8p8ppp99a99pp7ppp98p7p8o1a8o11dc7p27cj11o8a1o8p788ppp972pap888p717pp8p88aa1djcdahhhhhhh22o8ooo221oo
ggggggggggggggggggggad1oo888pp9899p9799pph7p9998p7p8217888o1d7p27d1o8887128p7ppp9pa72papp8pp717p88pp9aao11cdahhhhhhh822ooo8o1282
gggggggggggggggggggga1ooooo8opp8pp9799pphh7ppp888p7o217pp88o17p271o88pp712o7p9p9a9a72p799p9p7179p9p99a7ooo1dahhhhhho82o8o8821oo2
gggggggggggggggghhhhaoo8888pppp999799pphhh7p9999ppp72179p8p887p2788pppp7127999ppp9972p79apa97197ppp9a978o8o1ahhhhh28828oo8o128o2
ggggghhhgggggghhhhhha8888p8999pa9799pphhhh799aa9p9pp71799p99p7p27ppp9p9717999ap99a972p7aa99p71p799pp7p7p888oa1hh11888o8oo821o8o1
gggghhhhhhgghhhhhhhha88pp9p99999799pphhhhh79pppp9a999779appp87p27p99app7799aaa99aa972p7aapaa72p79ap9727p8pp8a11112888oo28o228o2h
gghhhhhhhhhhhhhhhhhh7pp99a99aa9799pphhhhhh8799999aaa9a799999p7po7ppp9p97aa999ppaaa782879pp997287aapa727p88pp71111o88o21oo28o2212
ghhhhhhhhhhhhhhhhhhh7pppppp999799pphhhhhhhhp799app999aaa9aa979po979999aaaa9a9a9aa7p2o7a9aaa97287aa97p27p9pp97111188822112o88o221
hhhhhhhhhhhhhhhhhhhh799p9aaa9799pphhhhhhhh11p7aa9aaaaaaa9a9799po9979aa9a99pa9aaa7p2oa97aaaa97o89799722799p99711128882118o88o2212
hhhhhhhhhhhhhhhhhhhh7aapaaa9799pphh111hh11111p7aaaaa99pp9a799pp2p997aa9aaa9aaaa7p229p997a9997o897aa72o7a9p9p7111828o218o882o22o2
hhhhhhhhhhhhhhhhhhhh7pppaa97pppph1111111111111p7a99aa9aaa799ppo2pp99799aaa9aa97p2222pp997a9a7o8p7a792o7aa99972118o2o2o8882o28o21
hhhhhhhhhhhhhhhhhhhh799p99979p81111111111111111p7a9aa9aa799pp822opp9979a9a9997p222222pp997aa7o887a78287aap9a72228822288882oo8211
hhhhhhhhhhhhhhhhhh11799a9aa79p811111111111111222dcdddc9a99pp822228pp997a9aa97p22222222pp997a7o887a7228799paa722888o2o8882o28o1h1
hhhhhhhhhhh11hhh1111799a99979p811111111111222221ggdjjjdp9pp822oooo8pp9979aa7poooooo2222pp9977o889792op7aa99972o888oo88o2o8o82h12
hhhhhhhhh11111h1111179aaaaa79p8111112222222222jdj1hdjjjdpp82ooooooo8pp9a797poooooooooo22pp9a2o8897928p7aaa9a728888o8882o8oo2o12o
h11h11hh1111111111117999p9979p8111222222222ooojjjj1hddccd82ooo8888oo8pp9a7poo88888ooooooop922o8p97aopp7aaa9a7o888oo88oo88o2o8228
1111111111111111111179paaaa7pp8222222222ooooojdhj1jdjj11djoo88888888o8ppa9o88888888888ooooo2228pa7popp79pp9a7888o288o28882o8o1oo
111111111111111111117apaaa978po2222222oooooo8d111j1jdddccj88888888888o8p988888888888888ooo88o2899228pp7a9aaa78o8o82o2o88o1882o28
111111111111111111117a9aaa9788o2222ooooooo888jh11jh11hg12d1333rp888888o8888888888888888888888op8oo28p87a99997o88o8o22o8o122o2188
111111111111111111117aaaaa9a7oo22oooooooo88881h1hdh1hh1o9dhj3j3rbp88888o8ppp888888888888888888oo88o8887a9aaa7o8o8882o88o22821o88
11122211111111112222799a99979ao2oooo888o8888pd1hhdhhgg2p7jh1j133r79pp88ppppppppp88888pppp8888888888oo7aaaaaa7oo888oo88822o21ho8o
122222221221111222227aaaa9799p9ooo888888888ppj1gggdhgho9cj1j31j33b79pppp9999ppppp88ppppppp888888888oa97aaaaa7o88ooo88882o21h18o2
222222222222112222227aaaa799ppoo888888888pppppjhg1jj1jdcdj1jjjhj3rbb9999999999pppppppppppppppppp8889p997aa997o888oo888o288212o21
222222222222222222oo799a799ppo88888888pppp999r11ghj1gd1dj1j3r3g1333j99999999999pppp99999pppppppppp88pp997aaa78888o888812882h221h
2222222222222222oooo79a799ppo88888888pppp999rjhghgg1jdddjj3rbbjhjj9p99999999999pp999999999pp999ppppp8pp997aa7888oo888o1o8o1h21hh
2122222222222ooooooo79799ppo888888ppppp9999r3g11ggggghhhj3rrrbrg1pa7p999999999p999999999999999999pppp8pp997a7888o88o812o8oh11hh1
22122ooo222oooooooo97799ppo888888ppppp9999b3jj3j11gggh1133rrrb71o89a9p9999999999999999999999999999pppp8pp997798o88ooo12oo211h111
2212oooooooooooooooa799pp88888888pppp9999b33j33jr3j1j3j1j3rrrrb1ho899p999999999999aaaaaa99999999999pppp8pp997a888ooo222oo2112o12
2o21ooooooooooooo8o7a9pp8888pp8pppppp99993j11j11jjj3rrrjj33rrr3jh1o8pap9999999999aaa777aaa999999999ppppp8pp9a7o888oo22oooo2o8222
22o2oooooooooo88888o899888pppppppp99p9999jh1j3rbrjj33rr31j3333jj1h11op9p8pp99999aaa77777aaa999999999ppppp8998o888oo8o2o8ooo8o22o
22oo2888oooo88888888oo888pppppppp9999p99phhj33rb7bjj33rr111jj33311hh1op2p8o89999aa7777777aaa9999pp9999pppp8oo888ooo88o88oo88o2oo
22o82o8888o888p988888pppppppppp999999999p1hj333bb7rjj3331jjj33rrj11hh118ohpoo999aa7777777aaaa9p999p99999ppp88888oo888888o8p88oo8
o2oo8op888888o8pap889ppppppp9999999999999jhjj33r333j1j31jjj3333rrjp1hh12h8ohp8997da7777777aa999p9ap9pp9pppp888p8888pp888ppp88888
oooo8oop8888ooo8pa9pp99pppp99999999999999p1hjj3jpa9oh11jjjj222j3r3p9hhhho2h8cdccdjaa7777777aa9ap99ap9apppp88pp8888ppppppppp88888
28oo28op888oooo8889pp99apppp999999999999993h1j1op9792h1jj12o8p823rp99hhhhhhdjcd1h9aaaaa77aa7a99a99apa8pppppppp888ppppppppppp888p
o8o8o88op8oooooo8888pp99ap9p99999999999999pj11o28p998h1112oo88o22j3999hhhh1jjdjgg99cdaaaa7aaaa97aa7appppppppppppppppppp7a9pppppp
oo8o288pppoooo8o88p88ppp9ap9p999999999999993jg1828ppph1h12o82o8p2jjdc99181g11jhh1hpj199aaaaaa7aa77aa89pppppppppppppppp798ppppppp
oo282oo8p98oooo88p98888pp9989p999999999999993gh1o28o8hhhh122o8po2dd1jd998ohgh1h1hgh1c9999aaa9a77777a299pppppppppppppp9a8pppppppp
o2o81o8o8p98o8oo89p888888ppp8pp999999999999992ghh1o8p9ghh2o8o2o2jjcd1j99oo2hgh11ggc1d9999999a9a7777ao9999pppppppppppp998pppppppp
ooo82888o8p98888p9888888888888pp999999999999992hhg28p99gh122o22jj1jdjr9991o21gghc1dhp9999999999a77a9899999pp999pppp88po12ppppppp
o28oo888oo8pp88p98o888888888p9p8p99829999999999phh12p998hhh11jcd1j1133b9991121g1dhj9999999999999aa98p999999997aa9p88oo2112pppppp
ooo28o882oo8pppp8oo88oo8888821888p9h1999999999998hh28ppp21j1jdjcdgjjjrb9999p1121j1p9999999999999pp8819999999a9pop88oo28111o99pp9
oo2ooo8oo88o8p888o88o88o88pp1j199p2199999999999991hh28888h1gdj1jcd1133rb9999o2128o199999999999999888o2op9999999p2ooo2ph11h299999
82oooo8o8o8oop88oo8ooo8o8922h1hoo18999999999999999hhg12o22hgj1hd1cdj13bb9999822188oo99999999999999888oooop9999999pp2ohh1hh189999
o2oo8o8o8o8888p8o8ooo88o91h1hghho8pp99999999999993j1hg12ddjg1j1hjj7cjr3bb999po2o28o199999999999999p8888oo2p999999hhhoh121g1o8999
o2oo8828o8o8oo8p88ooo8op12h1hh1g8pppp999998p999r333j1hgjj1jjg1d1hd17cj3rb9999o2oooo2p999999999999a7p8888o21p99999ph28o221hh28p9p
oo2888o8o8o8o8o88o8oo881o811hh1o88ppppp99p88ppr33jghhhgj1jjdjg1djjcjdjj3a99998ooo2o289999999999999a7p8888211o8p99988h1oohhhhoo8o
o828888oo82o8ooo88oo81o28o21hg18888ppp99p888pr3j1h2211gh1jddcjgjddjdcdj8a99999822o22189999999999999a92o88o11111ooo2o882h1hhh1111
o8o88882o8o282o8o88o8o1o8h11g1188888p99pp888331g282o2hhh1jd1jdggjcjdd799aa9999982o2111899999999999pa9222o2211111o2o1hhhh2hh111hh
28ooo88o28o288888oooo8ho8h21121888888p88888c3jh8o1oh11hggjhjgg1h1jdjd9aaaaaa9999o2o11o1o999999999p8p82122op7a9o111111h121ghhhggg
o8oo88oo282o88o882o888218h2hhho888p8888888ccj31h1hh11hhgggggg1h1jooc8aaa7aaaaaaa8ooo1o828p999999pp88oo21o9a9o2phhh1h2a79ohhhgggg
oo2oo8ooo81oo88o88288oo1o821gg18888pp88888cd1jjj111hhghggggg1h1j8p999aa77aaaaaa9po28o1ooo12p9999hgpoo22o8pp2hhhhhhhhp88p9221129a
oo2oo82o88182882888oo81218211oho88888ppp88dd1jj1hhhhghhhh11jh1dhj89a77777777aaa99o2o8222oo21899p1hg2p811o11p21gghhh1111282oo2p8o
2o2oo2o88o1ooo82888o888oh821h8h2888888p99pdjjh1hhhhhh1jrbrd1jdhj1jp9aa77777aaa9998o18o1222221ppoo22hggo11h19p221h11122p82op8o11g
22oo222881118ooo88o8o888888hh821888888p8p9jj11hhggh13rb99djjch9jhj89aa77777aaa999p8o2o1121112h88h8o1hhg1hhp999822112oohh22hhhh1g
o2222oo881128882o8888o88888o182888888po888pjj1ggghj3r9999cdc19931jpaa7777777aa999988222h121112p81hoo211h2222999p22ooooh8o1hhh12g
oo222oo8121121p882822oo88881h88888888oo888883jhgg113b9p999cd9993j8aaaaa77a77aa9999988221h112212988o22hhohho999998o1ooo8h2o11221g
oooo2o8o2121221p89aa9p2op888h888o88282o2888883jhgh1jrb9p88p999993a9pp9aa7aaa7aap999p882hh121221h2928hh1hhop99999982128888o211hhg
oo2o28o2121121119p88o22o8p88hoo8oo2o28ooo8o8833jggh13b8op99999999p88pp9aaaaaaaa9ppp9p8o1h1o2o2oggggh1hggghhop99999oo2291po1hhhgg
8ooooo1111o111o881o22ooo228o1hoo22o222ooo8ooppr31gh1jrb8oo8p99993jh1jp9aa9999aaa9888pp8o112o22p2hhh2hggghhhh18p999poo2hggghhgggh
o8ooo1o2112189p8o2811221111h22222o211128pp99999rjggh1jro8p9999993jh113pa99p9pp99ap8888p8222oo288p2ohgghhh111111op99p211211ohghhh
ooo222111129po22oop21211oop9aaa99p8oo89p8o1hh12o3jggg1jrooo8p9993jhh1j3998pp888p99p8888p2128o2o8o2hhg1111111111hhhp9o1p1p81hghhh
82211111119o11122op818p9pp8oo11o8p999ph111222oooo3dcc77dop9999993jhh1139988p88888p9p88888218oo22hh1hp9p88o22222211hop128o2ghhhh1
1211111ho821hhh12p2o8o8opoh1121h1111p122ooo8888oo8dddccdoo8p99p8831hh1j9b888888888ppp8888o128o221118a9999pp8o22oo21h8o1ggghhh111
11111hhoa92hhhh18hhophhhoh1122112o22222o8pp8oo221jdcc7djdp99p888831gh1jrb88888888888pp88p8o22o2o212a9p8888ppp8o2oo2h18o21hh11112
1111hh29p82hhgoogg1oohggh1122o2oo888o228pp8o21ghh11jddjjdp88888883jgh1j3b8888888888888p988ooo222oop9p88888888888o221hh1o11222222
111hhhop21hh12gg2o88o1ggh1ooo128pp8o2112888ohghgjddc7cj1j8p8888883jgghj3b888888888888p98888o8o22oo9p8p8oooooo88888o211hh222ooo21
1hhh1h281hhhhgg1o1g882hg1oo211op8oo22o212ooghggg11cdjd11jg8p8888883hgh13b8888888888p99888888o2o22898po22o888oooo8888222112oo2211
hh11hg1o11ghhh1ohho8pg1go21111ooo888o211121gggg1djcjcd11jhg89p888831gg13b88888888p99p888897982o22p98o12ooo8888oooo8888221222o22o
111hghh12o21g11h12o8gg2121121h1o88o112o888gghgg11ddjdj1j1ghho99pp83jhg1jb888888p99p889a7988a982229p8o211122oo88ooo2o888o112ooooo
11hhghhp82h1hhhhh18hgg8112221hh211128888ohhghghjjdjcd11j1hhhg2899993hghjr888p999p8888889a989po8ohapo1112oo222222212pp8888o122oo2
1hhgg1p82hhghgghgggg18o122o22hh12oo88881gghhghjjjjjdj11jhghghhh28pp31ghjr9999p8888888888a9o88oo88a8o21h1222111hhh1pp888p8882222o
hhggo8221hgggghggh12oo122ooo21h12888881hghghghdddcccj1h1hghhhghhgo831ghjrpp8888888888889p8oo22oo8a882o2h1222221hhop8o2opp8o82222
hhhoo21hhg12o12oggghh12oo88oo1h1o8888ghhghhghhj1111jj1h1hhghghhgpgoj1gh138888888888888pp8oo2222opap8o88212oo21hhgo8o2222po8oo221
hho211hhhoo128ho8h11122o8888o2hho88hhhhhhhghhg1hhhhhjhh1ggghghhhp9h8po8p3888888888888a98oo822112p9p8288821121hhgg28o1111opo8o222
h288o11ooh2oh2ohohh2112o8888o21ho1ghhhhhhgghhg22oo2h1h1hhhhghhgh8p1o81o8op88888888888hh2o8o1o8h1p9882o88o12o21hgg182h1211p282121
18o211h122h12h2g2gh12112o888o21hhghghhhg1h1gh21oo8p21h1hhhhgghgg8811o11218p88888888p81hho212hohhppo8o2222111hhgggho2gh22182o2111
2o21hgggh1gh1g1g1ggghhggghghghghghg1hgg1hh1h222o8pp8ghhghhhhhhggo22111111op8888888o28oo8o11h12hhp8ooo2o211121hgggg1ogh121821211h
121hggghggghhhhhgghhggghhghh1hhg1h1hg1h1g2g1o1oo8pp8hghhhhhhghhh2o2h1h1h12p8888888pp888o11h12hhh888oo888o1h1hhgggggggg118o2221hh
h1gghhhghhhhghhhg1hgghh1h1h1hhhh1hhh1h1h211222oopppo1hhhhhhg979og21hhh1hh1p88888888oo22111ghhhhh8p8oo8888ohh2o8792gggg1o122222hh
ghgghhghhhhhhghg1hgg2p9aa9oh1hh1hhh2h11h1hho12o88979hhhhhgh9897p81hhhhhhh18g888888888oo221hhhhhho9882o8888hh2o7a8221hgh1122o22hh
ggghhhghh1hhhhg1hhg89aaaaaaph12h1h2h12h1h12oh22887ap9ghhhgggg8a9821hhhhhh1oggo888888p8221hghhhhh2ao82o8888hh1o79opp82hgh12ooo2hg
ghhhhhhh1hghhh11hhp9aa99pp97p1h1g1112h2h21go212289a88hhhhhhgg89po12hhhhh1282gg1o8888o21hhh111ghh1aoo222ooo112oa9899p82hh11ooo2hg
hhhg1hhhhghhhhhh1p9a9pp8oo8pao1h2112h2h11hh1ooo8op99hh12oo221pp81h11hhh12o8pgggho888888888o211hhh9o2o12o8822op9p8p9pp82hh12oo2gg
hhh1hhghghhhh1hh89a9pp8882o89ph121oh1h12g1h2o28p88p9po8p99p8o88ogghh1hhh2o8892hgg1o8p777p888211hh982o2o8888o889p88pp88o2h12ooogg
hg1hhhhh1hhh1hh2p99pp8o12o2o8912hog1212121ho228ppo8p28ppppppo8o2hgghh1hh2oo8p9oghggp99aa7po8811hh98282o888oo888p2o88o88o1p22oohg
h1h1hh11hhg11h18999p8o111122op22oh1oh1oho1h2o2o8881g2o88888oo221hgggg1hh2oo88ppoghgpo899a918a791hp8o822o8o882oo22ooooo8222a2oohg
hh1hh11hgg12hh2p99ppo21211h22822h1o112ho1128o12o8ohh122ooooo2hh1gggggh1h22oo888pgggg1o899p891a79o88ooo22oo28221112oo289p28722o1g
h11h1h1gg12h118p99p8o121h121282ho11h112ohh88211221hgh12222221hh1gggggh2h12ooo8oooggggg29pp1o2aap8p8o2o212222211112222o99a7912o1h
11h1g2g12og112899p8o21og12oh1o2o1hh2112g128oo2oo211hhhh1111hhhg1gg1ggg21h22oo228pggh2p8pp8889a98o82o12o2121211hhh122111p99o1122h
1h1hog121g111op99poo222128hh22o2h1811oh11oo2oo8pp2oghhhhhhhhhhghg1oggg1oh1288oo88gho988oo888p9p88o2o21o211h11hhhhh1111222h112221
h1hog22hghh118p921ggg12181hoo211oo21o2h12822o8pppoh1ghhhhhhhhggh1h2gggh21ho888228gh9p8o22o8888o28o22222o211hhhgggh111hhhhh12oo22
h22g111gh11118oghhhhhgh812oo212o812o2122o821o88p8ohghhghhhhggggghh1hhg111122oo22oh2p8o21h12oooo182o2oo12221hhgggggh111hhh1211o22
12g12ohh1oo1ogh11hghhgg2ooo222811oo21122o8o12888o2hgghgggggggggghh1h1oo88ooo222289p8o1h12h1222218o21oo212211hggggh12o8pph11gh121
gg11o11o8goohhh22o1hgggh8o222822o8o12oo2288h2o8o211gggggggggggggh1h188pppp8o2211p882hh12hghh11hh221122211111hhggh1112o8pp1gggh12

__gff__
82233e4402149c5602c383637071110e1c627001170ef02b421078749c30701ec03162882111b353149d22048a80bb0ff1101b9eb0e8a9c8bab68c0ff1100ff1100ff1100ff1100ff1100f4190aa1484b32cd5aa835ba61839c12d42a6cae096c1854970100070123f042c0a84cb3985cc50295204cfec90294b940c9102e381
a5085e2c79720f0e9502b302fa4b8a80ce9dbbf0e094c8311878c88c4e88d03902172501804859227800e02142067491caa147054f15307808177ef0211ee2211ee2211ec240a23f4440866f4786146059e12b327881177f88871070013c26623a42713538a636089902831bb848e922120a200fe9cbc35d20875c3e070cc105
__map__
5419243742591a820b10a68108ae1f800e00481362a6890200e6e00024851949c0768303b954aa44c9da094e9e5288c879c0b380085d787a425c0b10e5c503d151450044ee57151cd01fa0992172c26ca19ad2824ff070e4145d803841e20e213a44a041ccbd9b44220a6600bc10fe5174f09200fd038303a402e8025e0a8404
1e7f585cdc457c7f88877888877808120813a234831b0833a6c10d3478815045fcd798b163ee28c4981105e77f2046cc896a0e1000880811176a04c05a00c8891394ffa0191cdca1c314f21f00007e4340a4277014823842cf4f801cb9233f47009c9023e6185c8891734218de1c2172e7109fc02142e2145e80fe22ba81234c
88f002101e1cc71912c6e0c90e88e38c09623c8b4418ce00b84b872e20ba208ae0584efd01239c7f3cc4433cc44314081509212d8dd935841051a6e1238508264ce1f915983123c60000f07f0427262cff800931262e543048e58c1c1172284c00108334031cb9b2044014e23b4014591032afe306161204271182160a0474e4
10911723404898a0638a4ee0e91110c109883b42481037121027ec104fba2a0aa29fc233bd00702a8f1fce0e8808a38b63713c302483d01184174fe9905e1a85201efb2c10c6f964c3ef877888877808ff44f8fcc4c790a5bb1f11259569f8c0d2b582000061420491533462468cc786f15e0084192162e3c2130024514990b8
c3a00000243542923862919900448950b14b90647000214ad2ac6113c1015cca46f0584480281ea0b82072e708e9a0102242c8f9a0909780e0e0c26499239ae002839723a2f86a00e8d0870a6037200f2e40f90200382688f104002042e8e9341dc6b98b882fe026141c3340595b035ce4f7877888877888030042e56b991988
626256af2084a452ab6e4030554733e27e686bcc98e61a90149a288609b8546692b010264204384faa24e5dac1bc14d0a510155b8200b722b9810b42fe47002042e71e3cdc11ed75782046f3d41039e30d1e486683073a9ee045d4dec501317838618a5e84c1c51102f475e6211cba005511c81d220f91325798bb88ff0ff110
0ff1100ff1100ff1100ff1100f31e0211a7c451ee2211ee2211e4240a8848b546604429828d36b0620852a83f0c68c58417063c2fccf00b0072f722154a31b214c6a14b010264284230ca254e8dac500002244916160271690730c8104e2841c427273e2183c881172081fe408173dc4433cc411870c20ccc13b240080230a1f
80c8839763f0424c5e11c1033c7a39272fa2e0e59ebc4901917ba440c71429001167ea06140af4548dbef00354aa8030260f08999d131cc26f3cc4433cc44304799d22ea926b081fe0dcc3a73620243774eee9327968a2058048111c625884f0e0e9f1100ff1100ff11020103a4469063748664c831b48f082a48a09530422c2
1c00883100008c38b8220031624c01c1850a00a99c9123420e931a116290904f054fa2008842e4081d220f290064728408913b740139c04984a0238e0b4edcd7093142c4c8838b13c2f08821ee10a143e7549fc1019113f2e00088882340e80908303c0000c7940280423b3811060670c4f78018626246267784931519a58d38
380c6d9648e9006404b7700001f1fb211ee2211ee2211ee2211ee2211ee2210e0060a88208fefc0ff1100ff110254a204498b10c6e90d4a8043710aa24c30731664c2184393830630801c098398504a2e0c4c409112214c101842677449c78060750a610b94387115e100300427080240e1d85200e39c8317c0008e4c4915378
01448c3020a21338228811119cd0e3137a7022e79edd00b86700f4fc045017f1915e9c90430c6fe898f263b80085677001e4141f0242080d4448c12d33a801f0109e573120e2e7433cc4433c8480bc0f0069cc2444b75abd0a825b36ebf081a5ab8200615acfe8c48918af0de3080000928510a575e1090092b422483c6c5900
00929a269566b5e94d00d2ba55d962c6ea3f4989101b5e00af01467c0200f88c0b04f13e605c13421402798617725902450517265b1c455643768091cb11517c01c2091dfa337783f06fce8feb062e03623c950742e8e93402d2b9bf3470135b0350d6d60017f9ff211ee2211e6240a8848c5466044298986d03c12d559b86e0
86a9ba6e244d7624a8e0913ebac406976a0bcc248d011122cc7451d58985306600e12185b65c35310511bad81246bedb11c1fd956210f19200402c6be9433cc443fc09421571f000c7193c80f216b8d4e8e5193c00971620c4e815143c6311fc211c7e61c0a964d7c142ccf05c10889caee3b8211e08f41d05c8297c00762c44
1e35035d842c0521059c87c887bdff100ff1105fbee003b0bdc1cff178a39763f034c19000e72e3c7e93b7f3433cc4433cc4433c840884ad81e0d510bc18821767f0ca421022b4df0a945e00d452900831d66a89aa26820540788a2445577142419442b69457242204e4afc8e20b6e2054c2452ab3e021ca3a78a4d00e6ecc98
310517e0e0401cdc9830730e2e40881071092ee0c839c10c6e8edc61041740880110df2290738c1e4ec8838b73728477582046185ed021464f68c99abef30a4d1412220479f072dc51ec1ca287e385220a5fc4e12b52468a04478c566fb08778880300c47104d61b39c4fb46045d00e4f0e2ce1300f0e0c22e0200c0e004c4a9
16000527f0230c2f3e932a5244ab88101e3c99dded211ee2211ee2214c94403083644633b88130631d3e5459630a41449831634289200410070766940a8213534870d1004a0367e48830716542841524e49c900b094f881ca1731429213e2e0122741ed9c9498420eec5c5896340ac17628488b9c723004e08d343640c424f86
f85ef6100ff1100f41c0618a3978a9040f1026c1bb3b004092f8ff100ff1100f3151c3b501d0513e1777809c502c20f73d808e293811050770ee3b8828300022e6709d81019c1384e040785b088220140100c2583220642660288290113c831fe2211ee2211ee2211e42c0c31650f0220e5eeec16bbc672505af88e001b815ad
1ee2211ee2214a944088306319dc20a951096e205449860f62cc0a42483122cc38831324664e8831090801c098b923428420384052090eeec109842944ee1c7f100815880100213a4090848e42507802e0183e000472e2c829bc002246181025081c11c488084ee8750476ca435416d348516a0b00a24804c4c38c2d3b218819
115e31c6456e004de826ec88e1b9024ce5f2556b96af59034424f2b123880f583052094012811c790688b5bb04d011078759e31901dd2c0600062c9a45081c8d850800ce8703404e988213395c00d03901000310d36af679888778888730a070adc9904619be200b3ec4433cc4433cc4431422c41000c46938204d274084c1c1
1161780034be981c0353506022080c103202534460880a2e591200f01090872283a3c7433cc4433cc4433cc4438c0ad890a0128688cda0c2438c420820326bc78615bb06004042a3c6ac5db36000404463d78ea1f8848e183372c4d10000201febd0f9d889008b860d41e48ec80200e0902c72000e7d3d0072e21806c709d0d2
6e72449e9c1c4e933b001072051441590407f4ede2a91220c4e8042042660d0c940590c38b387800e561488164193e4066291481900c1fb07683670982c74067dc7a88875067fe79888778880b8790f4211ee2211ee2211ee2211ee2211ee2211ee2214a33380de135abd6888410408446ad25b367c9dd8c184e9c0c850747bb
c61142478c00004044dce140e2c40180481bdc0d02848e5285701e70e200a0489910a143484b811001422c2388c711dc35fcbb06463ec4433cc411870ca08e0c493040262904a5908c1ea233195233155f66cd464f2f967ee7ff7c888778888778880350a520b441e9d215dc204c9a081e59328287180999008000002583230f
51ca08005029528cc8985225232894f04808693245889401430a061e3285cb8408513800eedc2172870e5c2400e822848be0003c10c3012207003c2403e7215c78708090003c3c050000a100048f0458fe100ff1100f91fe885096c1db00214c4c44f800e7183c3c04060fcf4608e178052c3d5b5504afcae08e8ae158461e2f
2052804811108f633a0004c71efcd03a80109955d0398214514680858310b81fd900903b702179041022f0370841e0dc4104775080e01e5d187180e85d10d91d1942a0dc7b8887982c0921033273533ec4433cc4433cc4433cc4433cc4433cc4434095823006a95a7570cb122327b865ca5419dc22b830090e020040c8e0188e
c0a240849ca554a552a4709ed9a952940c1102a35306b708901e9c0245cae0c903410840e7ce11bac8f0e4c843b8701eb264c880089d2304e02244aa802e82078768002e203ca0d7310f1e22c273e7433cc4433cc4430864d81090153c53113c2d10dc206623b8008b140030bc4509001edca024040f4815c1034026f7aa13b1
0c5719162205f29011592225f29019412225c0288a08e45908c20907278fe03820005c0080c86d081844402c1ce110828763b000e711bc2244107819e2971fe221264a7ac880101eb1f30b20f8a3f77cc24060f8804cdfde053eaac04570881f219c3b3fc4433cc4018054a5208c65cad215dc226598086e1122650517081902
890527109922ba19984ae13ca349960ce120b213982c814d1d0e104544b3748e108213b04c813cca442044e83c049cc46370e42e323878c0541e0f312902baca304840910245f6314fe930c31ba40c187b0c223fb8e7177091128b1b600a40c714811c79707caa9fe002b1996470048831998443001e4e007283635773000e9d
3b86909c04e8532d82c0f78778888778888778888778888778088208d3e0131e3e2082f72ff23dc4433c0464a90a6390325569082110226518082e9022444a082e19c249ece5598854c6a39564b094a52238858854c94ba5000038548a92c1536678f090214b200f690480c3142193230c5900b8c3102e832374910038f2e021
8223001202808be0213c38b84b0021b30e388c8308902a64c9080e003c40c89029e2df433cc4433cc4433cc4433cc4430050fa8778888778881dc13a00172e222022680bb86f45087284089d677801870efdab4201624c608820801c8f23b8208ad8cf103c8fe206f18c21c49d2384f0161e2c20b8df4b70f0c8eba10ff11003
a54a4228cb94193c32444c67448a90113c226388004899d1c14a963400b264b114a92a1200c810a552a44ae1b2a4080f8ab0e0285202479e3227800374951078c8e02102027021006088e0318a3c8e2238644c02778830e243e50e400700333b640a00081100cfe498fc100ff1100f5102c10b2c780083085f59c1035246f090
10183cc09b23449aa3f6433cc45f00e0448810be082f241c22441ec12510224091c1c5313878c6456aac02401ec1059c3b80e8062e3c382414928843482e00c119bfc90d823b878f68945078f8100ff11057a5209441e9d215dc204c9a081e599703821889270002e02138f210a99201005522c58894a5b207e22220a4c91046
808b4a112265709c0d1832a58be4ce51040788d03942170e412407e030848b800e00440a84435c02970c807b78b74678f2288be008871d98f7100ff1100fe1fe085f62c10b22f84318cbea00002e307a400a0f1e1ec103580687f04956002ac2598400591280cb480c910244ae844c813082231a40c8140ee228824b0470ee10
__sfx__
30d407f0232401ee57200123824708c30081143826020f141006117a04038200cd013283503002379012a0260934727001320260aa452180602f1123a720000704a441de360e4200702418467050612243428312
64830f442090638105217000103406c402034001922003462c2500042204f162bc20173043e866201420643428125221413092604000044371ec4739d603f571227021e81621071227021e81621071227020e003
09d093511ef30389400724708a42121011c302259540c07111012036510424411c0423415062640900400824031272822509300002542511324e421044200c100c4253202609b062121100c7020a01254613a244
a24716c7380041801400e501407212102008701c0000a2012e8102343408200008170807001e041006122c5001116050100fd722032021413390313f82403163047142467322821259072e270008110380325013
1011dfc12070201702389202765237b060d635000012102410710012450a0713c8342b523208140807221301200140f07219c041122400f2207434194002f4202ef0405812258150900008b06087320000224610
00d208040176500767094301eb341fd05294053cd772107122a0407e571f7143c82403163047143c82403163047143c82403163047140cd2102a0106c220b53530d103044622047245630000020c020081018440
824b46f8072600e26324d420a644112160495014e22200102492407a6208a4000811220240ad10210151400011a150513222244109053901427370010020f4003c8200b2011e43130024019600035012d4423012
22e38ba7067320fe430fc0710470117000c441166012a45238103082401e00212f10071262b93024801019451350011f5222457051302f840066700117001642029570a82211375005311186532c020b2601e806
ca92105c0c61300b011c263051000424021043011010724031a030001704a443184321e142856600a65394140e472207132b0200ab023e44708e30381400b315158642042529b151001420426182231006520024
3fff211e32820134121006522820377250894020746020073451717e202115300d0012602036570795410002121020cc213247401122341403b702029242c0400400010053373640c02400e46351550177102617
3ea0430c22763080120ca0030215292173662509b2119861040260a301150650032508c36292623c4330181208a070406012147079270012008b0600c6107a0728321294002243428f0429054014341106312656
88e09ede0e75510542308731a6570fc101b126173301f9272dd751f3220181035770313010fc0710470313010fc071185100e270200010e5308e260a0701e013036510043719210136513a24409e040d80107907
4505972c20822031221046502f1402007305071f615104550a810381630f46708e303894007a002c42521160129322a520210200293218400017620213638d54144000560438d4010c0524012381440857619061
2a05f2d82231021120270420e81525e50122020b9300c8711044330b012101438a07031430b94031c411580002646347143c82403163047141c0400000121e141252630b440a07620454200133c64509a0019865
9132a23a1d8401cf100bc3208840217600092204b75060701352634d101836001e442d06106a622e6703130139f161012111c632501106005300613a9400724708e30389400724708e303800020363046710f437
0c04170802026064330094627f143136704107044023c8533801410c431f102200001060108401305413c0430651230d0030820076110887609d033511208060389400724708e520a44119952148201004419213
64590190112122502027030102120a2552422121725154310ab430f5010903532c2003531000140626215a52246320535308a11110613c024303012001538c5424341079713c4250e5343e85000e031830036d10
2b1038f2298010725401c0529215380071126303105062400e80417473047143c82403163047141802438a100c07511e043b254212223c067001202f04419c06030523950406c3731124053721c4161c01707241
f0d601be20b011a10100e14100613c44415011100002e1040fb220f00010e6006c021694307c72088760f3211981439e3637f400724708e30200402e70603061229070720330970217513cc34104733c04306c70
92214b2512742014632fd200353410b7621071227021e816218120a50430d101464233047049403c1711121202634262401921008863031030a32516401123250a22625015151070821529054154701121500840
05370701075451200030b21214150643011e730001538137001000271000332082011e2211044304c36231100460232073048312747019d4621c633a22626c300c6230fc0710470313011d80010400190621c024
905f3c831b610029220ab072670314c070346103d660724708e3038c30102210e7013aa402d2400140110402025702ec01024002e50434917243413c063026163f412203310085018376018042f6133c44300021
24100a220361634d07203013dc04115723c85428f0403163047143c82403163047143c82403163047143c024009202f8070c570313010fc07100301b07232a660064021d432656204c3319545128101b9601c611
43a680400412007a2308225294140426419d0429064252442581330820004741926324d400c474082672034114c4109a0505b51158740350404820076410ba050371521560080202e01524210199152d35104804
6888140e30c141d6100044122c020b02101716227141c000083053d8732076100341068350b50209015159170022519063043260467708c1018a2210220214133a1000ba473b3010fc000b246074011c7021e326
7a8887783dd710084414c03164711906122c102354322615040041ec743865010710010142e110270701001621400174003101202101202400ea65137522e04300b001c4143c0200007624b520e4401002009927
46202c91088100d41703402150701601218d6204a4611602360513a7540c2403303522054066413b052154342024233232259651102431016399400a564380670d34027f022040220e5111416076340c01424706
1e8220c2217001094308c16220470dc3208071027240a3400ec41320063030121417230440ac3030e7533171227020c0131c55129821049202f52406a232ca070144511602250153894720b063eb362107122702
a11a7c0008e530876110c0411000009461cf2000001394403b9440380008a0622b750e0633802224827303642180015b050273600000061470773004b0602871167370872032d370724708e30389400724300806
1911249c03733383362081001a2333142064753be30389400724708e30389400724708e3038e0010e0310c17210162001425b5514101013360db540c076330372d9302f6070940224d350c6401e64025c1404240
482e0908074701163404c013b82710201102051044332344291000f6203691503163047141012413c10106420316414d42144220a3643091014e041105738d0000075190361333022c7120700087633811322047
211ee221198140375008103001612894102c1419853301020936010e3004142210620201204a06160412cc131f81621071227021e81621071227021e8161b550036143f3040c071004171df2721071227021e816
1e0ff1101e81621071227021e8162107122702080620ce100264530513231302d84321603231511cb25186662d4370b44522d3101907044563ff373fd77377773ff373fd77377773ff373fd77276443f3102bf73
fabffffb0fc0710470313010f40700c773ff77218273ff773f7733df013ec671e81621071227021e816210712270210f773df753f70208d623ff62259701d306198573ef763fb772ff773ef763fb772f77700864
49fee4663f02039e373f97630046363010fc071047021042009203b0100042224402045500400302064040201e90000000020302206212400020101006200215007070ae32170410cd441f265009110704432153
e2059be212a67097202c44700600020621c3753273237804247000a0240c11701c7617005001240462108b030d354074451f41008835010631386319f032e30001b250b8412d1001bd3705044014700090010400
042a490900c0425240382210085122d0210211290600847238321070402142420000020501e004141220410615126084000c3403e7170535120805329403d3430af3418721206002000725b02010670312300240
28130102121002880408c1622413004100381623c712047605a0120b100204037801108301a062103110194327743065210f80033b133f01121003002100607020e512112607a042cb10010400f0412150204411
3148760700a203206220012220503650228c75361403b2603820200410064601c02110c04090200700430c140d03138d04024731810124e3438412010010c3440362039522026420c2630a8600a5430335400855
022282d12990320430200420521303802305512746308f01004400e0010c113234001b143000203c602284002c5330a10400a201b14439b650480022663364012473100430010042854121610048120ae0502814
c2024078002103fb200be601661108c000966004615311452c87708146070310041020612319002845220c77018532c103004422c16000a0424303268010a8040410326645008750fd001171135d300d80038353
0178f1e1304062b5652cd62010120d002041120ea04200610c20404413013200480330d501fe40293603e011182463dc121cc7120600010040000420021100470020000040287310060005460178202843019101
8f309673278001f4711e906090022286703711041451302204941084052282009c0000120021261c505252341d2300d15114f4201c173f371217711ea0030e10095760a021294052621419211053733c01100202
080cd09f0dc053fb050a0311af0402d36211450300104000107210441328800013202a04509d203586220d221583534a101527518d150e0353a7060d57318d66076233f306357711600001e401674000c041c816
8400810831210024050020200021000040090001410070101604224046200241d301071741ce4330d2602f4113807041011a8772174000144185401050200d2200425020250b0051384101f021282000b420fa57
21a6dbc704774276671a3103377026467144501011200d4200426028210703630142018201986030a160ea77287000502539041004031fe0719443367163fc212ac533dd441710609c5321d45137631d20021520
804320043d13100452074653ff271fd750082002040008000282506c723aa0615570006773455600040149012c000004142b003034430c00002410220222e62306c7226a06153613c255026352b0020170107000
11f180121400200800024023042104167047343c156002001103009f011826032411011060043000001201060592204a0330f3221227000020a9700822110831297400e0150612016924029400aa400fc2004b10
1131fe1937232134730e0553fe271bd153fc601673011e21155413176713c200085033b4613f0000934004720680007d551753415c070001236e7212c500db140c67616f30009241f33422710083530a4451f967
24d6644611d1705f6310d00057123114304c1402520161321e46716b20233141d2260d520169240e67732927255423e33130e561d94705e7008f071fc7708e7018a16342031a000026072e2771751404b633c143
b99e005a140202410400a253c16430100010122b5562ab57272021c4561600422b5039f61232663db40285621cc041051511525132603a31331c001f5362052127b362f17404f373d12412b441a0061954118501
09af3f31372362385000117240771f32424d75071600ae07070231e65005602227122a23633a563721117224167361dc20086441cf561f9202b7621eb030a9620db26319270041236c073321222d1131b533ab72
36e0e6873e533317003d31000a0408c3422f602f2440824036830010613d145041253111728f573e6440ca4002601152610b61330c501311418114088640011404010049240614200a4007800210151e13503145
c2126044039242f8640f8702f3462d027221243cb1434a3205a1624601182613a112288721b6241811108060204740100330211330161f9523da450882507047346002513508920391210564718e100020022672
c31fc280056430810700c121a06118004001163ec1713e62167563da4021400048453cf411f6471536126f641fb61314733bf133f975011552b4061ae4531531337010402208a0003041052030f93318e7039b41
7edb43600090008072024651e81031c1028036301733514624413103260ee4530c7022a130fc112a52037b11003501801008e630603012061007160fe470425023325062270cc321001505151264010801226716
1e0e609a016000436618a242d9641771726e211584419770013030ee5318e7020a410f41210504344410b10126f4117c1731471339021767304c143c850023630c7002001031e043141126f07158360fd5139406
607085f13b44503b2227d143c863023630ca060540108040200000564300a5005633028002225319f110d07626d34033500366624b640dc172805023b640345536f030804333f1438b05033101c1640143000001
ec3105b60131008e471863001170088012de753a844352710260612903314711e101126630440206647080143ae171082015c17210403e925026520c6352cc45239522ce7301002202032ab1718e750400437961
cf2273923971430860019052b8201867033f450ee47302100401004d620ff751da202d74707b650bb202db3524c571df3000d001f0571ce041b046080022e3430c6000c062226140f404045150104211e1228832
90be1d403d83220130118010220018836208423d5540c73138b04015663e301042110610300f00288602e85039b412bb130c37033a641ec37337700191021120018752e12017941076470c7323bd170394313107
98fff6e6335761dd31071050cf30118250c7723ba643f61500d04054620c714308643e6430c10601240331002007021064201242dd0003b0014a6611600038651632130d312105021104200040443518c1038e13
323f04613de17333702200134b1322864018212d82506753253030f404184651e810082570380527c1003410080400c3260f40418706040600000400e040507308a0007641040461b41105d441c6671967101903
0c2020b3251772d6261e1132f56526f7137b66056011ce310620022d60033632670200f5114a410ec1738150338471f37102a072b5630c2163e864009040240024850324730c6133fc17014270940500c460b070
__music__
04 42380170
02 06491d70
04 700b0750
06 235c0317
00 445e4706
0e 08624953
09 7f211e02
00 20552908
06 67193274
02 05374819
0a 26025b04
03 487d2621
0c 43203170
08 62191c51
09 2c4a384f
07 60022952
06 38086c04
08 0e530667
00 7012284d
0c 626b0160
08 284b3844
09 70040e7d
08 20561a3a
08 08551262
0a 4b304811
04 2a650504
0a 70613020
01 73102900
01 400c705c
01 044f0421
04 52227478
04 7a011912
07 531b074c
00 19303045
05 64470828
07 2e10000e
08 3d2d2a08
05 23704229
0d 441d3a70
02 60620111
0e 2647607a
06 00112f0c
00 1c423447
02 020c680e
08 0e111c32
02 1900081e
04 425e270d
05 7f3e4443
06 58162a60
08 06295355
06 79064224
01 48301041
0a 207f6327
00 65081141
08 203c3000
0f 10457c01
0d 0e41264a
01 6d22214d
0d 3a2a690d
04 004a062a
0d 61321944
0e 034f3b60
0a 212b2303
00 631f4466

